podonoghue/usbdm-firmware/USBDM_Kinetis/Project_Headers/MK20DX128M5.h
/****************************************************************************************************//**
 * @file     MK20D5.h
 *
 * @brief    CMSIS Cortex-M Peripheral Access Layer Header File for MK20D5.
 *           Equivalent: MK20DN128M5, MK20DX128M5, MK20DX64M5, MK20DX32M5, MK20DN32M5, MK20DN64M5
 *
 * @version  V0.0
 * @date     2014/10
 *
 *******************************************************************************************************/

#ifndef MCU_MK20D5
#define MCU_MK20D5

#include <stdint.h>
#ifdef __cplusplus
extern "C" {
#endif

/* -------------------------  Interrupt Number Definition  ------------------------ */

typedef enum {
/* --------------------  Cortex-M Processor Exceptions Numbers  ------------------- */
  Reset_IRQn                    = -15,   /*!<   1 Reset Vector, invoked on Power up and warm reset                                 */
  NonMaskableInt_IRQn           = -14,   /*!<   2 Non maskable Interrupt, cannot be stopped or preempted                           */
  HardFault_IRQn                = -13,   /*!<   3 Hard Fault, all classes of Fault                                                 */
  MemoryManagement_IRQn         = -12,   /*!<   4 Memory Management, MPU mismatch, including Access Violation and No Match         */
  BusFault_IRQn                 = -11,   /*!<   5 Bus Fault, Pre-Fetch-, Memory Access Fault, other address/memory related Fault   */
  UsageFault_IRQn               = -10,   /*!<   6 Usage Fault, i.e. Undef Instruction, Illegal State Transition                    */
  SVCall_IRQn                   =  -5,   /*!<  11 System Service Call via SVC instruction                                          */
  DebugMonitor_IRQn             =  -4,   /*!<  12 Debug Monitor                                                                    */
  PendSV_IRQn                   =  -2,   /*!<  14 Pendable request for system service                                              */
  SysTick_IRQn                  =  -1,   /*!<  15 System Tick Timer                                                                */
/* ----------------------   MK20D5 VectorTable                       ---------------------- */
  DMA0_IRQn                     =   0,   /*!<  16 DMA channel 0 transfer complete interrupt                                        */
  DMA1_IRQn                     =   1,   /*!<  17 DMA channel 1 transfer complete interrupt                                        */
  DMA2_IRQn                     =   2,   /*!<  18 DMA channel 2 transfer complete interrupt                                        */
  DMA3_IRQn                     =   3,   /*!<  19 DMA channel 3 transfer complete interrupt                                        */
  DMA_Error_IRQn                =   4,   /*!<  20 DMA error interrupt                                                              */
  FTFL_Command_IRQn             =   6,   /*!<  22 FTFL interrupt                                                                   */
  FTFL_Collision_IRQn           =   7,   /*!<  23 FTFL Read collision interrupt                                                    */
  PMC_IRQn                      =   8,   /*!<  24 PMC Low Voltage Detect, Low Voltage Warning                                      */
  LLWU_IRQn                     =   9,   /*!<  25 LLWU Low Leakage Wakeup                                                          */
  WDOG_IRQn                     =  10,   /*!<  26 WDOG interrupt                                                                   */
  I2C0_IRQn                     =  11,   /*!<  27 I2C0 interrupt                                                                   */
  SPI0_IRQn                     =  12,   /*!<  28 SPI0 interrupt                                                                   */
  I2S0_Tx_IRQn                  =  13,   /*!<  29 I2S0 transmit interrupt                                                          */
  I2S0_Rx_IRQn                  =  14,   /*!<  30 I2S0 receive interrupt                                                           */
  UART0_LON_IRQn                =  15,   /*!<  31 UART0 LON interrupt                                                              */
  UART0_RxTx_IRQn               =  16,   /*!<  32 UART0 receive/transmit interrupt                                                 */
  UART0_Error_IRQn              =  17,   /*!<  33 UART0 error interrupt                                                            */
  UART1_RxTx_IRQn               =  18,   /*!<  34 UART1 receive/transmit interrupt                                                 */
  UART1_Error_IRQn              =  19,   /*!<  35 UART1 error interrupt                                                            */
  UART2_RxTx_IRQn               =  20,   /*!<  36 UART2 receive/transmit interrupt                                                 */
  UART2_Error_IRQn              =  21,   /*!<  37 UART0 error interrupt                                                            */
  ADC0_IRQn                     =  22,   /*!<  38 ADC0 interrupt                                                                   */
  CMP0_IRQn                     =  23,   /*!<  39 CMP0 interrupt                                                                   */
  CMP1_IRQn                     =  24,   /*!<  40 CMP1 interrupt                                                                   */
  FTM0_IRQn                     =  25,   /*!<  41 FTM0 fault, overflow and channels interrupt                                      */
  FTM1_IRQn                     =  26,   /*!<  42 FTM1 fault, overflow and channels interrupt                                      */
  CMT_IRQn                      =  27,   /*!<  43 CMT interrupt                                                                    */
  RTC_Alarm_IRQn                =  28,   /*!<  44 RTC interrupt                                                                    */
  RTC_Seconds_IRQn              =  29,   /*!<  45 RTC seconds interrupt                                                            */
  PIT_Ch0_IRQn                  =  30,   /*!<  46 PIT timer channel 0 interrupt                                                    */
  PIT_Ch1_IRQn                  =  31,   /*!<  47 PIT timer channel 1 interrupt                                                    */
  PIT_Ch2_IRQn                  =  32,   /*!<  48 PIT timer channel 2 interrupt                                                    */
  PIT_Ch3_IRQn                  =  33,   /*!<  49 PIT timer channel 3 interrupt                                                    */
  PDB0_IRQn                     =  34,   /*!<  50 PDB0 Programmable Delay Block interrupt                                          */
  USBOTG_IRQn                   =  35,   /*!<  51 USB0 OTG interrupt                                                               */
  USBDCD_IRQn                   =  36,   /*!<  52 USBDCD interrupt                                                                 */
  TSI0_IRQn                     =  37,   /*!<  53 TSI0 interrupt                                                                   */
  MCG_IRQn                      =  38,   /*!<  54 MCG interrupt                                                                    */
  LPTMR0_IRQn                   =  39,   /*!<  55 LPTMR Low Power Timer interrupt                                                  */
  PORTA_IRQn                    =  40,   /*!<  56 Port A interrupt                                                                 */
  PORTB_IRQn                    =  41,   /*!<  57 Port B interrupt                                                                 */
  PORTC_IRQn                    =  42,   /*!<  58 Port C interrupt                                                                 */
  PORTD_IRQn                    =  43,   /*!<  59 Port D interrupt                                                                 */
  PORTE_IRQn                    =  44,   /*!<  60 Port E interrupt                                                                 */
  SWI_IRQn                      =  45,   /*!<  61 Software interrupt                                                               */
} IRQn_Type;

/* -------------------------  Exception Handlers  ------------------------ */
extern void NMI_Handler(void);
extern void HardFault_Handler(void);
extern void MemManage_Handler(void);
extern void BusFault_Handler(void);
extern void UsageFault_Handler(void);
extern void SVC_Handler(void);
extern void DebugMon_Handler(void);
extern void PendSV_Handler(void);
extern void SysTick_Handler(void);
extern void DMA0_IRQHandler(void);
extern void DMA1_IRQHandler(void);
extern void DMA2_IRQHandler(void);
extern void DMA3_IRQHandler(void);
extern void DMA_Error_IRQHandler(void);
extern void FTFL_Command_IRQHandler(void);
extern void FTFL_Collision_IRQHandler(void);
extern void PMC_IRQHandler(void);
extern void LLWU_IRQHandler(void);
extern void WDOG_IRQHandler(void);
extern void I2C0_IRQHandler(void);
extern void SPI0_IRQHandler(void);
extern void I2S0_Tx_IRQHandler(void);
extern void I2S0_Rx_IRQHandler(void);
extern void UART0_LON_IRQHandler(void);
extern void UART0_RxTx_IRQHandler(void);
extern void UART0_Error_IRQHandler(void);
extern void UART1_RxTx_IRQHandler(void);
extern void UART1_Error_IRQHandler(void);
extern void UART2_RxTx_IRQHandler(void);
extern void UART2_Error_IRQHandler(void);
extern void ADC0_IRQHandler(void);
extern void CMP0_IRQHandler(void);
extern void CMP1_IRQHandler(void);
extern void FTM0_IRQHandler(void);
extern void FTM1_IRQHandler(void);
extern void CMT_IRQHandler(void);
extern void RTC_Alarm_IRQHandler(void);
extern void RTC_Seconds_IRQHandler(void);
extern void PIT_Ch0_IRQHandler(void);
extern void PIT_Ch1_IRQHandler(void);
extern void PIT_Ch2_IRQHandler(void);
extern void PIT_Ch3_IRQHandler(void);
extern void PDB0_IRQHandler(void);
extern void USBOTG_IRQHandler(void);
extern void USBDCD_IRQHandler(void);
extern void TSI0_IRQHandler(void);
extern void MCG_IRQHandler(void);
extern void LPTMR0_IRQHandler(void);
extern void PORTA_IRQHandler(void);
extern void PORTB_IRQHandler(void);
extern void PORTC_IRQHandler(void);
extern void PORTD_IRQHandler(void);
extern void PORTE_IRQHandler(void);
extern void SWI_IRQHandler(void);

/* ================================================================================ */
/* ================      Processor and Core Peripheral Section     ================ */
/* ================================================================================ */

/* ----------------Configuration of the cm4 Processor and Core Peripherals---------------- */
#define __CM4_REV                0x0100
#define __MPU_PRESENT            0
#define __NVIC_PRIO_BITS         4
#define __Vendor_SysTickConfig   0
#define __FPU_PRESENT            0

#include <core_cm4.h>   /*!< Cortex-M processor and core peripherals                              */

#ifndef __IO
#define __IO volatile 
#endif

#ifndef __I
#define __I volatile const
#endif

