podonoghue/usbdm-firmware/USBDM_Kinetis/Project_Headers/MK20DX128M5.h
/* ------- DMA_INT                                  ------ */
#define DMA_INT_INT0_MASK                        (0x01UL << DMA_INT_INT0_SHIFT)                      /*!< DMA_INT: INT0 Mask                      */
#define DMA_INT_INT0_SHIFT                       0                                                   /*!< DMA_INT: INT0 Position                  */
#define DMA_INT_INT1_MASK                        (0x01UL << DMA_INT_INT1_SHIFT)                      /*!< DMA_INT: INT1 Mask                      */
#define DMA_INT_INT1_SHIFT                       1                                                   /*!< DMA_INT: INT1 Position                  */
#define DMA_INT_INT2_MASK                        (0x01UL << DMA_INT_INT2_SHIFT)                      /*!< DMA_INT: INT2 Mask                      */
#define DMA_INT_INT2_SHIFT                       2                                                   /*!< DMA_INT: INT2 Position                  */
#define DMA_INT_INT3_MASK                        (0x01UL << DMA_INT_INT3_SHIFT)                      /*!< DMA_INT: INT3 Mask                      */
#define DMA_INT_INT3_SHIFT                       3                                                   /*!< DMA_INT: INT3 Position                  */
#define DMA_INT_INT4_MASK                        (0x01UL << DMA_INT_INT4_SHIFT)                      /*!< DMA_INT: INT4 Mask                      */
#define DMA_INT_INT4_SHIFT                       4                                                   /*!< DMA_INT: INT4 Position                  */
#define DMA_INT_INT5_MASK                        (0x01UL << DMA_INT_INT5_SHIFT)                      /*!< DMA_INT: INT5 Mask                      */
#define DMA_INT_INT5_SHIFT                       5                                                   /*!< DMA_INT: INT5 Position                  */
#define DMA_INT_INT6_MASK                        (0x01UL << DMA_INT_INT6_SHIFT)                      /*!< DMA_INT: INT6 Mask                      */
#define DMA_INT_INT6_SHIFT                       6                                                   /*!< DMA_INT: INT6 Position                  */
#define DMA_INT_INT7_MASK                        (0x01UL << DMA_INT_INT7_SHIFT)                      /*!< DMA_INT: INT7 Mask                      */
#define DMA_INT_INT7_SHIFT                       7                                                   /*!< DMA_INT: INT7 Position                  */
#define DMA_INT_INT8_MASK                        (0x01UL << DMA_INT_INT8_SHIFT)                      /*!< DMA_INT: INT8 Mask                      */
#define DMA_INT_INT8_SHIFT                       8                                                   /*!< DMA_INT: INT8 Position                  */
#define DMA_INT_INT9_MASK                        (0x01UL << DMA_INT_INT9_SHIFT)                      /*!< DMA_INT: INT9 Mask                      */
#define DMA_INT_INT9_SHIFT                       9                                                   /*!< DMA_INT: INT9 Position                  */
#define DMA_INT_INT10_MASK                       (0x01UL << DMA_INT_INT10_SHIFT)                     /*!< DMA_INT: INT10 Mask                     */
#define DMA_INT_INT10_SHIFT                      10                                                  /*!< DMA_INT: INT10 Position                 */
#define DMA_INT_INT11_MASK                       (0x01UL << DMA_INT_INT11_SHIFT)                     /*!< DMA_INT: INT11 Mask                     */
#define DMA_INT_INT11_SHIFT                      11                                                  /*!< DMA_INT: INT11 Position                 */
#define DMA_INT_INT12_MASK                       (0x01UL << DMA_INT_INT12_SHIFT)                     /*!< DMA_INT: INT12 Mask                     */
#define DMA_INT_INT12_SHIFT                      12                                                  /*!< DMA_INT: INT12 Position                 */
#define DMA_INT_INT13_MASK                       (0x01UL << DMA_INT_INT13_SHIFT)                     /*!< DMA_INT: INT13 Mask                     */
#define DMA_INT_INT13_SHIFT                      13                                                  /*!< DMA_INT: INT13 Position                 */
#define DMA_INT_INT14_MASK                       (0x01UL << DMA_INT_INT14_SHIFT)                     /*!< DMA_INT: INT14 Mask                     */
#define DMA_INT_INT14_SHIFT                      14                                                  /*!< DMA_INT: INT14 Position                 */
#define DMA_INT_INT15_MASK                       (0x01UL << DMA_INT_INT15_SHIFT)                     /*!< DMA_INT: INT15 Mask                     */
#define DMA_INT_INT15_SHIFT                      15                                                  /*!< DMA_INT: INT15 Position                 */

/* ------- DMA_ERR                                  ------ */
#define DMA_ERR_ERR0_MASK                        (0x01UL << DMA_ERR_ERR0_SHIFT)                      /*!< DMA_ERR: ERR0 Mask                      */
#define DMA_ERR_ERR0_SHIFT                       0                                                   /*!< DMA_ERR: ERR0 Position                  */
#define DMA_ERR_ERR1_MASK                        (0x01UL << DMA_ERR_ERR1_SHIFT)                      /*!< DMA_ERR: ERR1 Mask                      */
#define DMA_ERR_ERR1_SHIFT                       1                                                   /*!< DMA_ERR: ERR1 Position                  */
#define DMA_ERR_ERR2_MASK                        (0x01UL << DMA_ERR_ERR2_SHIFT)                      /*!< DMA_ERR: ERR2 Mask                      */
#define DMA_ERR_ERR2_SHIFT                       2                                                   /*!< DMA_ERR: ERR2 Position                  */
#define DMA_ERR_ERR3_MASK                        (0x01UL << DMA_ERR_ERR3_SHIFT)                      /*!< DMA_ERR: ERR3 Mask                      */
#define DMA_ERR_ERR3_SHIFT                       3                                                   /*!< DMA_ERR: ERR3 Position                  */
#define DMA_ERR_ERR4_MASK                        (0x01UL << DMA_ERR_ERR4_SHIFT)                      /*!< DMA_ERR: ERR4 Mask                      */
#define DMA_ERR_ERR4_SHIFT                       4                                                   /*!< DMA_ERR: ERR4 Position                  */
#define DMA_ERR_ERR5_MASK                        (0x01UL << DMA_ERR_ERR5_SHIFT)                      /*!< DMA_ERR: ERR5 Mask                      */
#define DMA_ERR_ERR5_SHIFT                       5                                                   /*!< DMA_ERR: ERR5 Position                  */
#define DMA_ERR_ERR6_MASK                        (0x01UL << DMA_ERR_ERR6_SHIFT)                      /*!< DMA_ERR: ERR6 Mask                      */
#define DMA_ERR_ERR6_SHIFT                       6                                                   /*!< DMA_ERR: ERR6 Position                  */
#define DMA_ERR_ERR7_MASK                        (0x01UL << DMA_ERR_ERR7_SHIFT)                      /*!< DMA_ERR: ERR7 Mask                      */
#define DMA_ERR_ERR7_SHIFT                       7                                                   /*!< DMA_ERR: ERR7 Position                  */
#define DMA_ERR_ERR8_MASK                        (0x01UL << DMA_ERR_ERR8_SHIFT)                      /*!< DMA_ERR: ERR8 Mask                      */
#define DMA_ERR_ERR8_SHIFT                       8                                                   /*!< DMA_ERR: ERR8 Position                  */
#define DMA_ERR_ERR9_MASK                        (0x01UL << DMA_ERR_ERR9_SHIFT)                      /*!< DMA_ERR: ERR9 Mask                      */
#define DMA_ERR_ERR9_SHIFT                       9                                                   /*!< DMA_ERR: ERR9 Position                  */
#define DMA_ERR_ERR10_MASK                       (0x01UL << DMA_ERR_ERR10_SHIFT)                     /*!< DMA_ERR: ERR10 Mask                     */
#define DMA_ERR_ERR10_SHIFT                      10                                                  /*!< DMA_ERR: ERR10 Position                 */
#define DMA_ERR_ERR11_MASK                       (0x01UL << DMA_ERR_ERR11_SHIFT)                     /*!< DMA_ERR: ERR11 Mask                     */
#define DMA_ERR_ERR11_SHIFT                      11                                                  /*!< DMA_ERR: ERR11 Position                 */
#define DMA_ERR_ERR12_MASK                       (0x01UL << DMA_ERR_ERR12_SHIFT)                     /*!< DMA_ERR: ERR12 Mask                     */
#define DMA_ERR_ERR12_SHIFT                      12                                                  /*!< DMA_ERR: ERR12 Position                 */
#define DMA_ERR_ERR13_MASK                       (0x01UL << DMA_ERR_ERR13_SHIFT)                     /*!< DMA_ERR: ERR13 Mask                     */
#define DMA_ERR_ERR13_SHIFT                      13                                                  /*!< DMA_ERR: ERR13 Position                 */
#define DMA_ERR_ERR14_MASK                       (0x01UL << DMA_ERR_ERR14_SHIFT)                     /*!< DMA_ERR: ERR14 Mask                     */
#define DMA_ERR_ERR14_SHIFT                      14                                                  /*!< DMA_ERR: ERR14 Position                 */
#define DMA_ERR_ERR15_MASK                       (0x01UL << DMA_ERR_ERR15_SHIFT)                     /*!< DMA_ERR: ERR15 Mask                     */
#define DMA_ERR_ERR15_SHIFT                      15                                                  /*!< DMA_ERR: ERR15 Position                 */

/* ------- DMA_HRS                                  ------ */
#define DMA_HRS_HRS0_MASK                        (0x01UL << DMA_HRS_HRS0_SHIFT)                      /*!< DMA_HRS: HRS0 Mask                      */
#define DMA_HRS_HRS0_SHIFT                       0                                                   /*!< DMA_HRS: HRS0 Position                  */
#define DMA_HRS_HRS1_MASK                        (0x01UL << DMA_HRS_HRS1_SHIFT)                      /*!< DMA_HRS: HRS1 Mask                      */
#define DMA_HRS_HRS1_SHIFT                       1                                                   /*!< DMA_HRS: HRS1 Position                  */
#define DMA_HRS_HRS2_MASK                        (0x01UL << DMA_HRS_HRS2_SHIFT)                      /*!< DMA_HRS: HRS2 Mask                      */
#define DMA_HRS_HRS2_SHIFT                       2                                                   /*!< DMA_HRS: HRS2 Position                  */
#define DMA_HRS_HRS3_MASK                        (0x01UL << DMA_HRS_HRS3_SHIFT)                      /*!< DMA_HRS: HRS3 Mask                      */
#define DMA_HRS_HRS3_SHIFT                       3                                                   /*!< DMA_HRS: HRS3 Position                  */
#define DMA_HRS_HRS4_MASK                        (0x01UL << DMA_HRS_HRS4_SHIFT)                      /*!< DMA_HRS: HRS4 Mask                      */
#define DMA_HRS_HRS4_SHIFT                       4                                                   /*!< DMA_HRS: HRS4 Position                  */
#define DMA_HRS_HRS5_MASK                        (0x01UL << DMA_HRS_HRS5_SHIFT)                      /*!< DMA_HRS: HRS5 Mask                      */
#define DMA_HRS_HRS5_SHIFT                       5                                                   /*!< DMA_HRS: HRS5 Position                  */
#define DMA_HRS_HRS6_MASK                        (0x01UL << DMA_HRS_HRS6_SHIFT)                      /*!< DMA_HRS: HRS6 Mask                      */
#define DMA_HRS_HRS6_SHIFT                       6                                                   /*!< DMA_HRS: HRS6 Position                  */
#define DMA_HRS_HRS7_MASK                        (0x01UL << DMA_HRS_HRS7_SHIFT)                      /*!< DMA_HRS: HRS7 Mask                      */
#define DMA_HRS_HRS7_SHIFT                       7                                                   /*!< DMA_HRS: HRS7 Position                  */
#define DMA_HRS_HRS8_MASK                        (0x01UL << DMA_HRS_HRS8_SHIFT)                      /*!< DMA_HRS: HRS8 Mask                      */
#define DMA_HRS_HRS8_SHIFT                       8                                                   /*!< DMA_HRS: HRS8 Position                  */
#define DMA_HRS_HRS9_MASK                        (0x01UL << DMA_HRS_HRS9_SHIFT)                      /*!< DMA_HRS: HRS9 Mask                      */
#define DMA_HRS_HRS9_SHIFT                       9                                                   /*!< DMA_HRS: HRS9 Position                  */
#define DMA_HRS_HRS10_MASK                       (0x01UL << DMA_HRS_HRS10_SHIFT)                     /*!< DMA_HRS: HRS10 Mask                     */
#define DMA_HRS_HRS10_SHIFT                      10                                                  /*!< DMA_HRS: HRS10 Position                 */
#define DMA_HRS_HRS11_MASK                       (0x01UL << DMA_HRS_HRS11_SHIFT)                     /*!< DMA_HRS: HRS11 Mask                     */
#define DMA_HRS_HRS11_SHIFT                      11                                                  /*!< DMA_HRS: HRS11 Position                 */
#define DMA_HRS_HRS12_MASK                       (0x01UL << DMA_HRS_HRS12_SHIFT)                     /*!< DMA_HRS: HRS12 Mask                     */
#define DMA_HRS_HRS12_SHIFT                      12                                                  /*!< DMA_HRS: HRS12 Position                 */
#define DMA_HRS_HRS13_MASK                       (0x01UL << DMA_HRS_HRS13_SHIFT)                     /*!< DMA_HRS: HRS13 Mask                     */
#define DMA_HRS_HRS13_SHIFT                      13                                                  /*!< DMA_HRS: HRS13 Position                 */
#define DMA_HRS_HRS14_MASK                       (0x01UL << DMA_HRS_HRS14_SHIFT)                     /*!< DMA_HRS: HRS14 Mask                     */
#define DMA_HRS_HRS14_SHIFT                      14                                                  /*!< DMA_HRS: HRS14 Position                 */
#define DMA_HRS_HRS15_MASK                       (0x01UL << DMA_HRS_HRS15_SHIFT)                     /*!< DMA_HRS: HRS15 Mask                     */
#define DMA_HRS_HRS15_SHIFT                      15                                                  /*!< DMA_HRS: HRS15 Position                 */

/* ------- DMA_DCHPRI                               ------ */
#define DMA_DCHPRI_CHPRI_MASK                    (0x0FUL << DMA_DCHPRI_CHPRI_SHIFT)                  /*!< DMA_DCHPRI: CHPRI Mask                  */
#define DMA_DCHPRI_CHPRI_SHIFT                   0                                                   /*!< DMA_DCHPRI: CHPRI Position              */
#define DMA_DCHPRI_CHPRI(x)                      (((x)<<DMA_DCHPRI_CHPRI_SHIFT)&DMA_DCHPRI_CHPRI_MASK) /*!< DMA_DCHPRI                              */
#define DMA_DCHPRI_DPA_MASK                      (0x01UL << DMA_DCHPRI_DPA_SHIFT)                    /*!< DMA_DCHPRI: DPA Mask                    */
#define DMA_DCHPRI_DPA_SHIFT                     6                                                   /*!< DMA_DCHPRI: DPA Position                */
#define DMA_DCHPRI_ECP_MASK                      (0x01UL << DMA_DCHPRI_ECP_SHIFT)                    /*!< DMA_DCHPRI: ECP Mask                    */
#define DMA_DCHPRI_ECP_SHIFT                     7                                                   /*!< DMA_DCHPRI: ECP Position                */

