podonoghue/usbdm-firmware/USBDM_Kinetis/Project_Headers/MK20DX128M5.h
/* ------- DMA_DADDR                                ------ */
#define DMA_DADDR_DADDR_MASK                     (0xFFFFFFFFUL << DMA_DADDR_DADDR_SHIFT)             /*!< DMA_DADDR: DADDR Mask                   */
#define DMA_DADDR_DADDR_SHIFT                    0                                                   /*!< DMA_DADDR: DADDR Position               */
#define DMA_DADDR_DADDR(x)                       (((x)<<DMA_DADDR_DADDR_SHIFT)&DMA_DADDR_DADDR_MASK) /*!< DMA_DADDR                               */

/* ------- DMA_DOFF                                 ------ */
#define DMA_DOFF_DOFF_MASK                       (0xFFFFUL << DMA_DOFF_DOFF_SHIFT)                   /*!< DMA_DOFF: DOFF Mask                     */
#define DMA_DOFF_DOFF_SHIFT                      0                                                   /*!< DMA_DOFF: DOFF Position                 */
#define DMA_DOFF_DOFF(x)                         (((x)<<DMA_DOFF_DOFF_SHIFT)&DMA_DOFF_DOFF_MASK)     /*!< DMA_DOFF                                */

/* ------- DMA_CITER_ELINKNO                        ------ */
#define DMA_CITER_ELINKNO_CITER_MASK             (0x7FFFUL << DMA_CITER_ELINKNO_CITER_SHIFT)         /*!< DMA_CITER_ELINKNO: CITER Mask           */
#define DMA_CITER_ELINKNO_CITER_SHIFT            0                                                   /*!< DMA_CITER_ELINKNO: CITER Position       */
#define DMA_CITER_ELINKNO_CITER(x)               (((x)<<DMA_CITER_ELINKNO_CITER_SHIFT)&DMA_CITER_ELINKNO_CITER_MASK) /*!< DMA_CITER_ELINKNO                       */
#define DMA_CITER_ELINKNO_ELINK_MASK             (0x01UL << DMA_CITER_ELINKNO_ELINK_SHIFT)           /*!< DMA_CITER_ELINKNO: ELINK Mask           */
#define DMA_CITER_ELINKNO_ELINK_SHIFT            15                                                  /*!< DMA_CITER_ELINKNO: ELINK Position       */

/* ------- DMA_CITER_ELINKYES                       ------ */
#define DMA_CITER_ELINKYES_CITER_MASK            (0x1FFUL << DMA_CITER_ELINKYES_CITER_SHIFT)         /*!< DMA_CITER_ELINKYES: CITER Mask          */
#define DMA_CITER_ELINKYES_CITER_SHIFT           0                                                   /*!< DMA_CITER_ELINKYES: CITER Position      */
#define DMA_CITER_ELINKYES_CITER(x)              (((x)<<DMA_CITER_ELINKYES_CITER_SHIFT)&DMA_CITER_ELINKYES_CITER_MASK) /*!< DMA_CITER_ELINKYES                      */
#define DMA_CITER_ELINKYES_LINKCH_MASK           (0x0FUL << DMA_CITER_ELINKYES_LINKCH_SHIFT)         /*!< DMA_CITER_ELINKYES: LINKCH Mask         */
#define DMA_CITER_ELINKYES_LINKCH_SHIFT          9                                                   /*!< DMA_CITER_ELINKYES: LINKCH Position     */
#define DMA_CITER_ELINKYES_LINKCH(x)             (((x)<<DMA_CITER_ELINKYES_LINKCH_SHIFT)&DMA_CITER_ELINKYES_LINKCH_MASK) /*!< DMA_CITER_ELINKYES                      */
#define DMA_CITER_ELINKYES_ELINK_MASK            (0x01UL << DMA_CITER_ELINKYES_ELINK_SHIFT)          /*!< DMA_CITER_ELINKYES: ELINK Mask          */
#define DMA_CITER_ELINKYES_ELINK_SHIFT           15                                                  /*!< DMA_CITER_ELINKYES: ELINK Position      */

/* ------- DMA_DLASTSGA                             ------ */
#define DMA_DLASTSGA_DLASTSGA_MASK               (0xFFFFFFFFUL << DMA_DLASTSGA_DLASTSGA_SHIFT)       /*!< DMA_DLASTSGA: DLASTSGA Mask             */
#define DMA_DLASTSGA_DLASTSGA_SHIFT              0                                                   /*!< DMA_DLASTSGA: DLASTSGA Position         */
#define DMA_DLASTSGA_DLASTSGA(x)                 (((x)<<DMA_DLASTSGA_DLASTSGA_SHIFT)&DMA_DLASTSGA_DLASTSGA_MASK) /*!< DMA_DLASTSGA                            */

/* ------- DMA_CSR                                  ------ */
#define DMA_CSR_START_MASK                       (0x01UL << DMA_CSR_START_SHIFT)                     /*!< DMA_CSR: START Mask                     */
#define DMA_CSR_START_SHIFT                      0                                                   /*!< DMA_CSR: START Position                 */
#define DMA_CSR_INTMAJOR_MASK                    (0x01UL << DMA_CSR_INTMAJOR_SHIFT)                  /*!< DMA_CSR: INTMAJOR Mask                  */
#define DMA_CSR_INTMAJOR_SHIFT                   1                                                   /*!< DMA_CSR: INTMAJOR Position              */
#define DMA_CSR_INTHALF_MASK                     (0x01UL << DMA_CSR_INTHALF_SHIFT)                   /*!< DMA_CSR: INTHALF Mask                   */
#define DMA_CSR_INTHALF_SHIFT                    2                                                   /*!< DMA_CSR: INTHALF Position               */
#define DMA_CSR_DREQ_MASK                        (0x01UL << DMA_CSR_DREQ_SHIFT)                      /*!< DMA_CSR: DREQ Mask                      */
#define DMA_CSR_DREQ_SHIFT                       3                                                   /*!< DMA_CSR: DREQ Position                  */
#define DMA_CSR_ESG_MASK                         (0x01UL << DMA_CSR_ESG_SHIFT)                       /*!< DMA_CSR: ESG Mask                       */
#define DMA_CSR_ESG_SHIFT                        4                                                   /*!< DMA_CSR: ESG Position                   */
#define DMA_CSR_MAJORELINK_MASK                  (0x01UL << DMA_CSR_MAJORELINK_SHIFT)                /*!< DMA_CSR: MAJORELINK Mask                */
#define DMA_CSR_MAJORELINK_SHIFT                 5                                                   /*!< DMA_CSR: MAJORELINK Position            */
#define DMA_CSR_ACTIVE_MASK                      (0x01UL << DMA_CSR_ACTIVE_SHIFT)                    /*!< DMA_CSR: ACTIVE Mask                    */
#define DMA_CSR_ACTIVE_SHIFT                     6                                                   /*!< DMA_CSR: ACTIVE Position                */
#define DMA_CSR_DONE_MASK                        (0x01UL << DMA_CSR_DONE_SHIFT)                      /*!< DMA_CSR: DONE Mask                      */
#define DMA_CSR_DONE_SHIFT                       7                                                   /*!< DMA_CSR: DONE Position                  */
#define DMA_CSR_MAJORLINKCH_MASK                 (0x0FUL << DMA_CSR_MAJORLINKCH_SHIFT)               /*!< DMA_CSR: MAJORLINKCH Mask               */
#define DMA_CSR_MAJORLINKCH_SHIFT                8                                                   /*!< DMA_CSR: MAJORLINKCH Position           */
#define DMA_CSR_MAJORLINKCH(x)                   (((x)<<DMA_CSR_MAJORLINKCH_SHIFT)&DMA_CSR_MAJORLINKCH_MASK) /*!< DMA_CSR                                 */
#define DMA_CSR_BWC_MASK                         (0x03UL << DMA_CSR_BWC_SHIFT)                       /*!< DMA_CSR: BWC Mask                       */
#define DMA_CSR_BWC_SHIFT                        14                                                  /*!< DMA_CSR: BWC Position                   */
#define DMA_CSR_BWC(x)                           (((x)<<DMA_CSR_BWC_SHIFT)&DMA_CSR_BWC_MASK)         /*!< DMA_CSR                                 */

/* ------- DMA_BITER_ELINKNO                        ------ */
#define DMA_BITER_ELINKNO_BITER_MASK             (0x7FFFUL << DMA_BITER_ELINKNO_BITER_SHIFT)         /*!< DMA_BITER_ELINKNO: BITER Mask           */
#define DMA_BITER_ELINKNO_BITER_SHIFT            0                                                   /*!< DMA_BITER_ELINKNO: BITER Position       */
#define DMA_BITER_ELINKNO_BITER(x)               (((x)<<DMA_BITER_ELINKNO_BITER_SHIFT)&DMA_BITER_ELINKNO_BITER_MASK) /*!< DMA_BITER_ELINKNO                       */
#define DMA_BITER_ELINKNO_ELINK_MASK             (0x01UL << DMA_BITER_ELINKNO_ELINK_SHIFT)           /*!< DMA_BITER_ELINKNO: ELINK Mask           */
#define DMA_BITER_ELINKNO_ELINK_SHIFT            15                                                  /*!< DMA_BITER_ELINKNO: ELINK Position       */

/* ------- DMA_BITER_ELINKYES                       ------ */
#define DMA_BITER_ELINKYES_BITER_MASK            (0x1FFUL << DMA_BITER_ELINKYES_BITER_SHIFT)         /*!< DMA_BITER_ELINKYES: BITER Mask          */
#define DMA_BITER_ELINKYES_BITER_SHIFT           0                                                   /*!< DMA_BITER_ELINKYES: BITER Position      */
#define DMA_BITER_ELINKYES_BITER(x)              (((x)<<DMA_BITER_ELINKYES_BITER_SHIFT)&DMA_BITER_ELINKYES_BITER_MASK) /*!< DMA_BITER_ELINKYES                      */
#define DMA_BITER_ELINKYES_LINKCH_MASK           (0x0FUL << DMA_BITER_ELINKYES_LINKCH_SHIFT)         /*!< DMA_BITER_ELINKYES: LINKCH Mask         */
#define DMA_BITER_ELINKYES_LINKCH_SHIFT          9                                                   /*!< DMA_BITER_ELINKYES: LINKCH Position     */
#define DMA_BITER_ELINKYES_LINKCH(x)             (((x)<<DMA_BITER_ELINKYES_LINKCH_SHIFT)&DMA_BITER_ELINKYES_LINKCH_MASK) /*!< DMA_BITER_ELINKYES                      */
#define DMA_BITER_ELINKYES_ELINK_MASK            (0x01UL << DMA_BITER_ELINKYES_ELINK_SHIFT)          /*!< DMA_BITER_ELINKYES: ELINK Mask          */
#define DMA_BITER_ELINKYES_ELINK_SHIFT           15                                                  /*!< DMA_BITER_ELINKYES: ELINK Position      */

/* -------------------------------------------------------------------------------- */
/* -----------     'DMA' Register Access macros                         ----------- */
/* -------------------------------------------------------------------------------- */

#define DMA_CR                         (DMA->CR)
#define DMA_ES                         (DMA->ES)
#define DMA_ERQ                        (DMA->ERQ)
#define DMA_EEI                        (DMA->EEI)
#define DMA_CEEI                       (DMA->CEEI)
#define DMA_SEEI                       (DMA->SEEI)
#define DMA_CERQ                       (DMA->CERQ)
#define DMA_SERQ                       (DMA->SERQ)
#define DMA_CDNE                       (DMA->CDNE)
#define DMA_SSRT                       (DMA->SSRT)
#define DMA_CERR                       (DMA->CERR)
#define DMA_CINT                       (DMA->CINT)
#define DMA_INT                        (DMA->INT)
#define DMA_ERR                        (DMA->ERR)
#define DMA_HRS                        (DMA->HRS)
#define DMA_DCHPRI3                    (DMA->DCHPRI3)
#define DMA_DCHPRI2                    (DMA->DCHPRI2)
#define DMA_DCHPRI1                    (DMA->DCHPRI1)
#define DMA_DCHPRI0                    (DMA->DCHPRI0)
#define DMA_TCD0_SADDR                 (DMA->TCD[0].SADDR)
#define DMA_TCD0_SOFF                  (DMA->TCD[0].SOFF)
#define DMA_TCD0_ATTR                  (DMA->TCD[0].ATTR)
#define DMA_TCD0_NBYTES_MLNO           (DMA->TCD[0].NBYTES_MLNO)
#define DMA_TCD0_NBYTES_MLOFFNO        (DMA->TCD[0].NBYTES_MLOFFNO)
#define DMA_TCD0_NBYTES_MLOFFYES       (DMA->TCD[0].NBYTES_MLOFFYES)
#define DMA_TCD0_SLAST                 (DMA->TCD[0].SLAST)
#define DMA_TCD0_DADDR                 (DMA->TCD[0].DADDR)
#define DMA_TCD0_DOFF                  (DMA->TCD[0].DOFF)
#define DMA_TCD0_CITER_ELINKNO         (DMA->TCD[0].CITER_ELINKNO)
#define DMA_TCD0_CITER_ELINKYES        (DMA->TCD[0].CITER_ELINKYES)
#define DMA_TCD0_DLASTSGA              (DMA->TCD[0].DLASTSGA)
#define DMA_TCD0_CSR                   (DMA->TCD[0].CSR)
#define DMA_TCD0_BITER_ELINKNO         (DMA->TCD[0].BITER_ELINKNO)
#define DMA_TCD0_BITER_ELINKYES        (DMA->TCD[0].BITER_ELINKYES)
#define DMA_TCD1_SADDR                 (DMA->TCD[1].SADDR)
#define DMA_TCD1_SOFF                  (DMA->TCD[1].SOFF)
#define DMA_TCD1_ATTR                  (DMA->TCD[1].ATTR)
#define DMA_TCD1_NBYTES_MLNO           (DMA->TCD[1].NBYTES_MLNO)
#define DMA_TCD1_NBYTES_MLOFFNO        (DMA->TCD[1].NBYTES_MLOFFNO)
#define DMA_TCD1_NBYTES_MLOFFYES       (DMA->TCD[1].NBYTES_MLOFFYES)
#define DMA_TCD1_SLAST                 (DMA->TCD[1].SLAST)
#define DMA_TCD1_DADDR                 (DMA->TCD[1].DADDR)
#define DMA_TCD1_DOFF                  (DMA->TCD[1].DOFF)
#define DMA_TCD1_CITER_ELINKNO         (DMA->TCD[1].CITER_ELINKNO)
#define DMA_TCD1_CITER_ELINKYES        (DMA->TCD[1].CITER_ELINKYES)
#define DMA_TCD1_DLASTSGA              (DMA->TCD[1].DLASTSGA)
#define DMA_TCD1_CSR                   (DMA->TCD[1].CSR)
#define DMA_TCD1_BITER_ELINKNO         (DMA->TCD[1].BITER_ELINKNO)
#define DMA_TCD1_BITER_ELINKYES        (DMA->TCD[1].BITER_ELINKYES)
#define DMA_TCD2_SADDR                 (DMA->TCD[2].SADDR)
#define DMA_TCD2_SOFF                  (DMA->TCD[2].SOFF)
#define DMA_TCD2_ATTR                  (DMA->TCD[2].ATTR)
#define DMA_TCD2_NBYTES_MLNO           (DMA->TCD[2].NBYTES_MLNO)
#define DMA_TCD2_NBYTES_MLOFFNO        (DMA->TCD[2].NBYTES_MLOFFNO)
#define DMA_TCD2_NBYTES_MLOFFYES       (DMA->TCD[2].NBYTES_MLOFFYES)
#define DMA_TCD2_SLAST                 (DMA->TCD[2].SLAST)
#define DMA_TCD2_DADDR                 (DMA->TCD[2].DADDR)
#define DMA_TCD2_DOFF                  (DMA->TCD[2].DOFF)
#define DMA_TCD2_CITER_ELINKNO         (DMA->TCD[2].CITER_ELINKNO)
#define DMA_TCD2_CITER_ELINKYES        (DMA->TCD[2].CITER_ELINKYES)
#define DMA_TCD2_DLASTSGA              (DMA->TCD[2].DLASTSGA)
#define DMA_TCD2_CSR                   (DMA->TCD[2].CSR)
#define DMA_TCD2_BITER_ELINKNO         (DMA->TCD[2].BITER_ELINKNO)
#define DMA_TCD2_BITER_ELINKYES        (DMA->TCD[2].BITER_ELINKYES)
#define DMA_TCD3_SADDR                 (DMA->TCD[3].SADDR)
#define DMA_TCD3_SOFF                  (DMA->TCD[3].SOFF)
#define DMA_TCD3_ATTR                  (DMA->TCD[3].ATTR)
#define DMA_TCD3_NBYTES_MLNO           (DMA->TCD[3].NBYTES_MLNO)
#define DMA_TCD3_NBYTES_MLOFFNO        (DMA->TCD[3].NBYTES_MLOFFNO)
#define DMA_TCD3_NBYTES_MLOFFYES       (DMA->TCD[3].NBYTES_MLOFFYES)
#define DMA_TCD3_SLAST                 (DMA->TCD[3].SLAST)
#define DMA_TCD3_DADDR                 (DMA->TCD[3].DADDR)
#define DMA_TCD3_DOFF                  (DMA->TCD[3].DOFF)
#define DMA_TCD3_CITER_ELINKNO         (DMA->TCD[3].CITER_ELINKNO)
#define DMA_TCD3_CITER_ELINKYES        (DMA->TCD[3].CITER_ELINKYES)
#define DMA_TCD3_DLASTSGA              (DMA->TCD[3].DLASTSGA)
#define DMA_TCD3_CSR                   (DMA->TCD[3].CSR)
#define DMA_TCD3_BITER_ELINKNO         (DMA->TCD[3].BITER_ELINKNO)
#define DMA_TCD3_BITER_ELINKYES        (DMA->TCD[3].BITER_ELINKYES)

/* ================================================================================ */
/* ================           DMAMUX (file:DMAMUX_4CH)             ================ */
/* ================================================================================ */

/**
 * @brief DMA channel multiplexor
 */
typedef struct {                                /*!<       DMAMUX Structure                                             */
   __IO uint8_t   CHCFG[4];                     /*!< 0000: Channel Configuration Register                               */
} DMAMUX_Type;


/* -------------------------------------------------------------------------------- */
/* -----------     'DMAMUX' Position & Mask macros                      ----------- */
/* -------------------------------------------------------------------------------- */


/* ------- DMAMUX_CHCFG                             ------ */
#define DMAMUX_CHCFG_SOURCE_MASK                 (0x3FUL << DMAMUX_CHCFG_SOURCE_SHIFT)               /*!< DMAMUX_CHCFG: SOURCE Mask               */
#define DMAMUX_CHCFG_SOURCE_SHIFT                0                                                   /*!< DMAMUX_CHCFG: SOURCE Position           */
#define DMAMUX_CHCFG_SOURCE(x)                   (((x)<<DMAMUX_CHCFG_SOURCE_SHIFT)&DMAMUX_CHCFG_SOURCE_MASK) /*!< DMAMUX_CHCFG                            */
#define DMAMUX_CHCFG_TRIG_MASK                   (0x01UL << DMAMUX_CHCFG_TRIG_SHIFT)                 /*!< DMAMUX_CHCFG: TRIG Mask                 */
#define DMAMUX_CHCFG_TRIG_SHIFT                  6                                                   /*!< DMAMUX_CHCFG: TRIG Position             */
#define DMAMUX_CHCFG_ENBL_MASK                   (0x01UL << DMAMUX_CHCFG_ENBL_SHIFT)                 /*!< DMAMUX_CHCFG: ENBL Mask                 */
#define DMAMUX_CHCFG_ENBL_SHIFT                  7                                                   /*!< DMAMUX_CHCFG: ENBL Position             */

/* -------------------------------------------------------------------------------- */
/* -----------     'DMAMUX' Register Access macros                      ----------- */
/* -------------------------------------------------------------------------------- */

#define DMAMUX_CHCFG0                  (DMAMUX->CHCFG[0])
#define DMAMUX_CHCFG1                  (DMAMUX->CHCFG[1])
#define DMAMUX_CHCFG2                  (DMAMUX->CHCFG[2])
#define DMAMUX_CHCFG3                  (DMAMUX->CHCFG[3])

/* ================================================================================ */
/* ================           ETF (file:ETF_0)                     ================ */
/* ================================================================================ */

/**
 * @brief Embedded Trace Funnel
 */
typedef struct {                                /*!<       ETF Structure                                                */
   __IO uint32_t  FCR;                          /*!< 0000: Funnel Control Register                                      */
   __IO uint32_t  PCR;                          /*!< 0004: Priority Control Register                                    */
   __I  uint32_t  RESERVED0[953];               /*!< 0008:                                                              */
   __IO uint32_t  ITATBDATA0;                   /*!< 0EEC: Integration Register, ITATBDATA0                             */
   __IO uint32_t  ITATBCTR2;                    /*!< 0EF0: Integration Register, ITATBCTR2                              */
   __IO uint32_t  ITATBCTR1;                    /*!< 0EF4: Integration Register, ITATBCTR1                              */
   __IO uint32_t  ITATBCTR0;                    /*!< 0EF8: Integration Register, ITATBCTR0                              */
   __I  uint32_t  RESERVED1;                    /*!< 0EFC:                                                              */
   __IO uint32_t  ITCTRL;                       /*!< 0F00: Integration Mode Control Register                            */
   __I  uint32_t  RESERVED2[39];                /*!< 0F04:                                                              */
   __IO uint32_t  CLAIMSET;                     /*!< 0FA0: Claim Tag Set Register                                       */
   __IO uint32_t  CLAIMCLR;                     /*!< 0FA4: Claim Tag Clear Register                                     */
   __I  uint32_t  RESERVED3[2];                 /*!< 0FA8:                                                              */
   __O  uint32_t  LAR;                          /*!< 0FB0: Lock Access Register                                         */
   __I  uint32_t  LSR;                          /*!< 0FB4: Lock Status Register                                         */
   __I  uint32_t  AUTHSTATUS;                   /*!< 0FB8: Authentication Status Register                               */
   __I  uint32_t  RESERVED4[3];                 /*!< 0FBC:                                                              */
   __I  uint32_t  DEVID;                        /*!< 0FC8: Device ID Register                                           */
   __I  uint32_t  DEVTYPE;                      /*!< 0FCC: Device Type Identifier Register                              */
   __I  uint32_t  PIDR4;                        /*!< 0FD0: Peripheral Identification Register 4                         */
   __I  uint32_t  PIDR5;                        /*!< 0FD4: Peripheral Identification Register 5                         */
   __I  uint32_t  PIDR6;                        /*!< 0FD8: Peripheral Identification Register 6                         */
   __I  uint32_t  PIDR7;                        /*!< 0FDC: Peripheral Identification Register 7                         */
   __I  uint32_t  PIDR0;                        /*!< 0FE0: Peripheral Identification Register 0                         */
   __I  uint32_t  PIDR1;                        /*!< 0FE4: Peripheral Identification Register 1                         */
   __I  uint32_t  PIDR2;                        /*!< 0FE8: Peripheral Identification Register 2                         */
   __I  uint32_t  PIDR3;                        /*!< 0FEC: Peripheral Identification Register 3                         */
   __I  uint32_t  CIDR0;                        /*!< 0FF0: Component Identification Register 0                          */
   __I  uint32_t  CIDR1;                        /*!< 0FF4: Component Identification Register 1                          */
   __I  uint32_t  CIDR2;                        /*!< 0FF8: Component Identification Register 2                          */
   __I  uint32_t  CIDR3;                        /*!< 0FFC: Component Identification Register 3                          */
} ETF_Type;


/* -------------------------------------------------------------------------------- */
/* -----------     'ETF' Position & Mask macros                         ----------- */
/* -------------------------------------------------------------------------------- */


/* ------- ETF_FCR                                  ------ */
#define ETF_FCR_EnS0_MASK                        (0x01UL << ETF_FCR_EnS0_SHIFT)                      /*!< ETF_FCR: EnS0 Mask                      */
#define ETF_FCR_EnS0_SHIFT                       0                                                   /*!< ETF_FCR: EnS0 Position                  */
#define ETF_FCR_EnS1_MASK                        (0x01UL << ETF_FCR_EnS1_SHIFT)                      /*!< ETF_FCR: EnS1 Mask                      */
#define ETF_FCR_EnS1_SHIFT                       1                                                   /*!< ETF_FCR: EnS1 Position                  */
#define ETF_FCR_EnS2_MASK                        (0x01UL << ETF_FCR_EnS2_SHIFT)                      /*!< ETF_FCR: EnS2 Mask                      */
#define ETF_FCR_EnS2_SHIFT                       2                                                   /*!< ETF_FCR: EnS2 Position                  */
#define ETF_FCR_EnS3_MASK                        (0x01UL << ETF_FCR_EnS3_SHIFT)                      /*!< ETF_FCR: EnS3 Mask                      */
#define ETF_FCR_EnS3_SHIFT                       3                                                   /*!< ETF_FCR: EnS3 Position                  */
#define ETF_FCR_EnS4_MASK                        (0x01UL << ETF_FCR_EnS4_SHIFT)                      /*!< ETF_FCR: EnS4 Mask                      */
#define ETF_FCR_EnS4_SHIFT                       4                                                   /*!< ETF_FCR: EnS4 Position                  */
#define ETF_FCR_EnS5_MASK                        (0x01UL << ETF_FCR_EnS5_SHIFT)                      /*!< ETF_FCR: EnS5 Mask                      */
#define ETF_FCR_EnS5_SHIFT                       5                                                   /*!< ETF_FCR: EnS5 Position                  */
#define ETF_FCR_EnS6_MASK                        (0x01UL << ETF_FCR_EnS6_SHIFT)                      /*!< ETF_FCR: EnS6 Mask                      */
#define ETF_FCR_EnS6_SHIFT                       6                                                   /*!< ETF_FCR: EnS6 Position                  */
#define ETF_FCR_EnS7_MASK                        (0x01UL << ETF_FCR_EnS7_SHIFT)                      /*!< ETF_FCR: EnS7 Mask                      */
#define ETF_FCR_EnS7_SHIFT                       7                                                   /*!< ETF_FCR: EnS7 Position                  */
#define ETF_FCR_HT_MASK                          (0x0FUL << ETF_FCR_HT_SHIFT)                        /*!< ETF_FCR: HT Mask                        */
#define ETF_FCR_HT_SHIFT                         8                                                   /*!< ETF_FCR: HT Position                    */
#define ETF_FCR_HT(x)                            (((x)<<ETF_FCR_HT_SHIFT)&ETF_FCR_HT_MASK)           /*!< ETF_FCR                                 */

