podonoghue/usbdm-firmware/USBDM_Kinetis/Project_Headers/MK20DX128M5.h
/* ------- FMC_S0                                   ------ */
#define FMC_S0_valid_MASK                        (0x01UL << FMC_S0_valid_SHIFT)                      /*!< FMC_S0: valid Mask                      */
#define FMC_S0_valid_SHIFT                       0                                                   /*!< FMC_S0: valid Position                  */
#define FMC_S0_tag_MASK                          (0x1FFFUL << FMC_S0_tag_SHIFT)                      /*!< FMC_S0: tag Mask                        */
#define FMC_S0_tag_SHIFT                         6                                                   /*!< FMC_S0: tag Position                    */
#define FMC_S0_tag(x)                            (((x)<<FMC_S0_tag_SHIFT)&FMC_S0_tag_MASK)           /*!< FMC_S0                                  */

/* ------- FMC_S1                                   ------ */
#define FMC_S1_valid_MASK                        (0x01UL << FMC_S1_valid_SHIFT)                      /*!< FMC_S1: valid Mask                      */
#define FMC_S1_valid_SHIFT                       0                                                   /*!< FMC_S1: valid Position                  */
#define FMC_S1_tag_MASK                          (0x1FFFUL << FMC_S1_tag_SHIFT)                      /*!< FMC_S1: tag Mask                        */
#define FMC_S1_tag_SHIFT                         6                                                   /*!< FMC_S1: tag Position                    */
#define FMC_S1_tag(x)                            (((x)<<FMC_S1_tag_SHIFT)&FMC_S1_tag_MASK)           /*!< FMC_S1                                  */

/* ------- FMC_S0                                   ------ */
#define FMC_S0_data_MASK                         (0xFFFFFFFFUL << FMC_S0_data_SHIFT)                 /*!< FMC_S0: data Mask                       */
#define FMC_S0_data_SHIFT                        0                                                   /*!< FMC_S0: data Position                   */
#define FMC_S0_data(x)                           (((x)<<FMC_S0_data_SHIFT)&FMC_S0_data_MASK)         /*!< FMC_S0                                  */

/* ------- FMC_S1                                   ------ */
#define FMC_S1_data_MASK                         (0xFFFFFFFFUL << FMC_S1_data_SHIFT)                 /*!< FMC_S1: data Mask                       */
#define FMC_S1_data_SHIFT                        0                                                   /*!< FMC_S1: data Position                   */
#define FMC_S1_data(x)                           (((x)<<FMC_S1_data_SHIFT)&FMC_S1_data_MASK)         /*!< FMC_S1                                  */

/* -------------------------------------------------------------------------------- */
/* -----------     'FMC' Register Access macros                         ----------- */
/* -------------------------------------------------------------------------------- */

#define FMC_PFAPR                      (FMC->PFAPR)
#define FMC_PFB0CR                     (FMC->PFB0CR)
#define FMC_TAGVDW0S0                  (FMC->TAGVDW[0].S0)
#define FMC_TAGVDW0S1                  (FMC->TAGVDW[0].S1)
#define FMC_TAGVDW1S0                  (FMC->TAGVDW[1].S0)
#define FMC_TAGVDW1S1                  (FMC->TAGVDW[1].S1)
#define FMC_TAGVDW2S0                  (FMC->TAGVDW[2].S0)
#define FMC_TAGVDW2S1                  (FMC->TAGVDW[2].S1)
#define FMC_TAGVDW3S0                  (FMC->TAGVDW[3].S0)
#define FMC_TAGVDW3S1                  (FMC->TAGVDW[3].S1)
#define FMC_DATAW0S0                   (FMC->DATAW[0].S0)
#define FMC_DATAW0S1                   (FMC->DATAW[0].S1)
#define FMC_DATAW1S0                   (FMC->DATAW[1].S0)
#define FMC_DATAW1S1                   (FMC->DATAW[1].S1)
#define FMC_DATAW2S0                   (FMC->DATAW[2].S0)
#define FMC_DATAW2S1                   (FMC->DATAW[2].S1)
#define FMC_DATAW3S0                   (FMC->DATAW[3].S0)
#define FMC_DATAW3S1                   (FMC->DATAW[3].S1)

/* ================================================================================ */
/* ================           FPB (file:FPB)                       ================ */
/* ================================================================================ */

/**
 * @brief Flash Patch and Breakpoint Unit
 */
typedef struct {                                /*!<       FPB Structure                                                */
   __IO uint32_t  CTRL;                         /*!< 0000: FlashPatch Control Register                                  */
   __IO uint32_t  REMAP;                        /*!< 0004: FlashPatch Remap Register                                    */
   __IO uint32_t  COMP[8];                      /*!< 0008: FlashPatch Comparator Register                               */
   __I  uint32_t  RESERVED0[1002];              /*!< 0028:                                                              */
   __I  uint32_t  PID4;                         /*!< 0FD0: Peripheral Identification Register 4                         */
   __I  uint32_t  PID5;                         /*!< 0FD4: Peripheral Identification Register 5                         */
   __I  uint32_t  PID6;                         /*!< 0FD8: Peripheral Identification Register 6                         */
   __I  uint32_t  PID7;                         /*!< 0FDC: Peripheral Identification Register 7                         */
   __I  uint32_t  PID0;                         /*!< 0FE0: Peripheral Identification Register 0                         */
   __I  uint32_t  PID1;                         /*!< 0FE4: Peripheral Identification Register 1                         */
   __I  uint32_t  PID2;                         /*!< 0FE8: Peripheral Identification Register 2                         */
   __I  uint32_t  PID3;                         /*!< 0FEC: Peripheral Identification Register 3                         */
   __I  uint32_t  CID0;                         /*!< 0FF0: Component Identification Register 0                          */
   __I  uint32_t  CID1;                         /*!< 0FF4: Component Identification Register 1                          */
   __I  uint32_t  CID2;                         /*!< 0FF8: Component Identification Register 2                          */
   __I  uint32_t  CID3;                         /*!< 0FFC: Component Identification Register 3                          */
} FPB_Type;


/* -------------------------------------------------------------------------------- */
/* -----------     'FPB' Position & Mask macros                         ----------- */
/* -------------------------------------------------------------------------------- */


/* ------- FPB_CTRL                                 ------ */
#define FP_CTRL_ENABLE_MASK                      (0x01UL << FP_CTRL_ENABLE_SHIFT)                    /*!< FP_CTRL: ENABLE Mask                    */
#define FP_CTRL_ENABLE_SHIFT                     0                                                   /*!< FP_CTRL: ENABLE Position                */
#define FP_CTRL_KEY_MASK                         (0x01UL << FP_CTRL_KEY_SHIFT)                       /*!< FP_CTRL: KEY Mask                       */
#define FP_CTRL_KEY_SHIFT                        1                                                   /*!< FP_CTRL: KEY Position                   */
#define FP_CTRL_NUM_CODE_least_MASK              (0x0FUL << FP_CTRL_NUM_CODE_least_SHIFT)            /*!< FP_CTRL: NUM_CODE_least Mask            */
#define FP_CTRL_NUM_CODE_least_SHIFT             4                                                   /*!< FP_CTRL: NUM_CODE_least Position        */
#define FP_CTRL_NUM_CODE_least(x)                (((x)<<FP_CTRL_NUM_CODE_least_SHIFT)&FP_CTRL_NUM_CODE_least_MASK) /*!< FP_CTRL                                 */
#define FP_CTRL_NUM_LIT_MASK                     (0x0FUL << FP_CTRL_NUM_LIT_SHIFT)                   /*!< FP_CTRL: NUM_LIT Mask                   */
#define FP_CTRL_NUM_LIT_SHIFT                    8                                                   /*!< FP_CTRL: NUM_LIT Position               */
#define FP_CTRL_NUM_LIT(x)                       (((x)<<FP_CTRL_NUM_LIT_SHIFT)&FP_CTRL_NUM_LIT_MASK) /*!< FP_CTRL                                 */
#define FP_CTRL_NUM_CODE_most_MASK               (0x07UL << FP_CTRL_NUM_CODE_most_SHIFT)             /*!< FP_CTRL: NUM_CODE_most Mask             */
#define FP_CTRL_NUM_CODE_most_SHIFT              12                                                  /*!< FP_CTRL: NUM_CODE_most Position         */
#define FP_CTRL_NUM_CODE_most(x)                 (((x)<<FP_CTRL_NUM_CODE_most_SHIFT)&FP_CTRL_NUM_CODE_most_MASK) /*!< FP_CTRL                                 */

