podonoghue/usbdm-firmware/USBDM_Kinetis/Project_Headers/MK20DX128M5.h
/* ------- FPB_REMAP                                ------ */
#define FP_REMAP_REMAP_MASK                      (0xFFFFFFUL << FP_REMAP_REMAP_SHIFT)                /*!< FP_REMAP: REMAP Mask                    */
#define FP_REMAP_REMAP_SHIFT                     5                                                   /*!< FP_REMAP: REMAP Position                */
#define FP_REMAP_REMAP(x)                        (((x)<<FP_REMAP_REMAP_SHIFT)&FP_REMAP_REMAP_MASK)   /*!< FP_REMAP                                */
#define FP_REMAP_RMPSPT_MASK                     (0x01UL << FP_REMAP_RMPSPT_SHIFT)                   /*!< FP_REMAP: RMPSPT Mask                   */
#define FP_REMAP_RMPSPT_SHIFT                    29                                                  /*!< FP_REMAP: RMPSPT Position               */

/* ------- FPB_COMP                                 ------ */
#define FP_COMP_ENABLE_MASK                      (0x01UL << FP_COMP_ENABLE_SHIFT)                    /*!< FP_COMP: ENABLE Mask                    */
#define FP_COMP_ENABLE_SHIFT                     0                                                   /*!< FP_COMP: ENABLE Position                */
#define FP_COMP_COMP_MASK                        (0x7FFFFFFUL << FP_COMP_COMP_SHIFT)                 /*!< FP_COMP: COMP Mask                      */
#define FP_COMP_COMP_SHIFT                       2                                                   /*!< FP_COMP: COMP Position                  */
#define FP_COMP_COMP(x)                          (((x)<<FP_COMP_COMP_SHIFT)&FP_COMP_COMP_MASK)       /*!< FP_COMP                                 */
#define FP_COMP_REPLACE_MASK                     (0x03UL << FP_COMP_REPLACE_SHIFT)                   /*!< FP_COMP: REPLACE Mask                   */
#define FP_COMP_REPLACE_SHIFT                    30                                                  /*!< FP_COMP: REPLACE Position               */
#define FP_COMP_REPLACE(x)                       (((x)<<FP_COMP_REPLACE_SHIFT)&FP_COMP_REPLACE_MASK) /*!< FP_COMP                                 */

/* ------- FPB_PID4                                 ------ */
#define FP_PID4_JEP106_MASK                      (0x0FUL << FP_PID4_JEP106_SHIFT)                    /*!< FP_PID4: JEP106 Mask                    */
#define FP_PID4_JEP106_SHIFT                     0                                                   /*!< FP_PID4: JEP106 Position                */
#define FP_PID4_JEP106(x)                        (((x)<<FP_PID4_JEP106_SHIFT)&FP_PID4_JEP106_MASK)   /*!< FP_PID4                                 */
#define FP_PID4_c4KB_MASK                        (0x0FUL << FP_PID4_c4KB_SHIFT)                      /*!< FP_PID4: c4KB Mask                      */
#define FP_PID4_c4KB_SHIFT                       4                                                   /*!< FP_PID4: c4KB Position                  */
#define FP_PID4_c4KB(x)                          (((x)<<FP_PID4_c4KB_SHIFT)&FP_PID4_c4KB_MASK)       /*!< FP_PID4                                 */

/* ------- FPB_PID5                                 ------ */

/* ------- FPB_PID6                                 ------ */

/* ------- FPB_PID7                                 ------ */

/* ------- FPB_PID0                                 ------ */
#define FP_PID0_PartNumber_MASK                  (0xFFUL << FP_PID0_PartNumber_SHIFT)                /*!< FP_PID0: PartNumber Mask                */
#define FP_PID0_PartNumber_SHIFT                 0                                                   /*!< FP_PID0: PartNumber Position            */
#define FP_PID0_PartNumber(x)                    (((x)<<FP_PID0_PartNumber_SHIFT)&FP_PID0_PartNumber_MASK) /*!< FP_PID0                                 */

/* ------- FPB_PID1                                 ------ */
#define FP_PID1_PartNumber_MASK                  (0x0FUL << FP_PID1_PartNumber_SHIFT)                /*!< FP_PID1: PartNumber Mask                */
#define FP_PID1_PartNumber_SHIFT                 0                                                   /*!< FP_PID1: PartNumber Position            */
#define FP_PID1_PartNumber(x)                    (((x)<<FP_PID1_PartNumber_SHIFT)&FP_PID1_PartNumber_MASK) /*!< FP_PID1                                 */
#define FP_PID1_JEP106_identity_code_MASK        (0x0FUL << FP_PID1_JEP106_identity_code_SHIFT)      /*!< FP_PID1: JEP106_identity_code Mask      */
#define FP_PID1_JEP106_identity_code_SHIFT       4                                                   /*!< FP_PID1: JEP106_identity_code Position  */
#define FP_PID1_JEP106_identity_code(x)          (((x)<<FP_PID1_JEP106_identity_code_SHIFT)&FP_PID1_JEP106_identity_code_MASK) /*!< FP_PID1                                 */

/* ------- FPB_PID2                                 ------ */
#define FP_PID2_JEP106_identity_code_MASK        (0x07UL << FP_PID2_JEP106_identity_code_SHIFT)      /*!< FP_PID2: JEP106_identity_code Mask      */
#define FP_PID2_JEP106_identity_code_SHIFT       0                                                   /*!< FP_PID2: JEP106_identity_code Position  */
#define FP_PID2_JEP106_identity_code(x)          (((x)<<FP_PID2_JEP106_identity_code_SHIFT)&FP_PID2_JEP106_identity_code_MASK) /*!< FP_PID2                                 */
#define FP_PID2_Revision_MASK                    (0x0FUL << FP_PID2_Revision_SHIFT)                  /*!< FP_PID2: Revision Mask                  */
#define FP_PID2_Revision_SHIFT                   4                                                   /*!< FP_PID2: Revision Position              */
#define FP_PID2_Revision(x)                      (((x)<<FP_PID2_Revision_SHIFT)&FP_PID2_Revision_MASK) /*!< FP_PID2                                 */

/* ------- FPB_PID3                                 ------ */
#define FP_PID3_CustomerModified_MASK            (0x0FUL << FP_PID3_CustomerModified_SHIFT)          /*!< FP_PID3: CustomerModified Mask          */
#define FP_PID3_CustomerModified_SHIFT           0                                                   /*!< FP_PID3: CustomerModified Position      */
#define FP_PID3_CustomerModified(x)              (((x)<<FP_PID3_CustomerModified_SHIFT)&FP_PID3_CustomerModified_MASK) /*!< FP_PID3                                 */
#define FP_PID3_RevAnd_MASK                      (0x0FUL << FP_PID3_RevAnd_SHIFT)                    /*!< FP_PID3: RevAnd Mask                    */
#define FP_PID3_RevAnd_SHIFT                     4                                                   /*!< FP_PID3: RevAnd Position                */
#define FP_PID3_RevAnd(x)                        (((x)<<FP_PID3_RevAnd_SHIFT)&FP_PID3_RevAnd_MASK)   /*!< FP_PID3                                 */

/* ------- FPB_CID0                                 ------ */
#define FP_CID0_Preamble_MASK                    (0xFFUL << FP_CID0_Preamble_SHIFT)                  /*!< FP_CID0: Preamble Mask                  */
#define FP_CID0_Preamble_SHIFT                   0                                                   /*!< FP_CID0: Preamble Position              */
#define FP_CID0_Preamble(x)                      (((x)<<FP_CID0_Preamble_SHIFT)&FP_CID0_Preamble_MASK) /*!< FP_CID0                                 */

/* ------- FPB_CID1                                 ------ */
#define FP_CID1_Preamble_MASK                    (0x0FUL << FP_CID1_Preamble_SHIFT)                  /*!< FP_CID1: Preamble Mask                  */
#define FP_CID1_Preamble_SHIFT                   0                                                   /*!< FP_CID1: Preamble Position              */
#define FP_CID1_Preamble(x)                      (((x)<<FP_CID1_Preamble_SHIFT)&FP_CID1_Preamble_MASK) /*!< FP_CID1                                 */
#define FP_CID1_ComponentClass_MASK              (0x0FUL << FP_CID1_ComponentClass_SHIFT)            /*!< FP_CID1: ComponentClass Mask            */
#define FP_CID1_ComponentClass_SHIFT             4                                                   /*!< FP_CID1: ComponentClass Position        */
#define FP_CID1_ComponentClass(x)                (((x)<<FP_CID1_ComponentClass_SHIFT)&FP_CID1_ComponentClass_MASK) /*!< FP_CID1                                 */

/* ------- FPB_CID2                                 ------ */
#define FP_CID2_Preamble_MASK                    (0xFFUL << FP_CID2_Preamble_SHIFT)                  /*!< FP_CID2: Preamble Mask                  */
#define FP_CID2_Preamble_SHIFT                   0                                                   /*!< FP_CID2: Preamble Position              */
#define FP_CID2_Preamble(x)                      (((x)<<FP_CID2_Preamble_SHIFT)&FP_CID2_Preamble_MASK) /*!< FP_CID2                                 */

