podonoghue/usbdm-firmware/USBDM_Kinetis/Project_Headers/MK20DX128M5.h
#define FTM0_SC                        (FTM0->SC)
#define FTM0_CNT                       (FTM0->CNT)
#define FTM0_MOD                       (FTM0->MOD)
#define FTM0_C0SC                      (FTM0->CONTROLS[0].CnSC)
#define FTM0_C0V                       (FTM0->CONTROLS[0].CnV)
#define FTM0_C1SC                      (FTM0->CONTROLS[1].CnSC)
#define FTM0_C1V                       (FTM0->CONTROLS[1].CnV)
#define FTM0_C2SC                      (FTM0->CONTROLS[2].CnSC)
#define FTM0_C2V                       (FTM0->CONTROLS[2].CnV)
#define FTM0_C3SC                      (FTM0->CONTROLS[3].CnSC)
#define FTM0_C3V                       (FTM0->CONTROLS[3].CnV)
#define FTM0_C4SC                      (FTM0->CONTROLS[4].CnSC)
#define FTM0_C4V                       (FTM0->CONTROLS[4].CnV)
#define FTM0_C5SC                      (FTM0->CONTROLS[5].CnSC)
#define FTM0_C5V                       (FTM0->CONTROLS[5].CnV)
#define FTM0_C6SC                      (FTM0->CONTROLS[6].CnSC)
#define FTM0_C6V                       (FTM0->CONTROLS[6].CnV)
#define FTM0_C7SC                      (FTM0->CONTROLS[7].CnSC)
#define FTM0_C7V                       (FTM0->CONTROLS[7].CnV)
#define FTM0_CNTIN                     (FTM0->CNTIN)
#define FTM0_STATUS                    (FTM0->STATUS)
#define FTM0_MODE                      (FTM0->MODE)
#define FTM0_SYNC                      (FTM0->SYNC)
#define FTM0_OUTINIT                   (FTM0->OUTINIT)
#define FTM0_OUTMASK                   (FTM0->OUTMASK)
#define FTM0_COMBINE                   (FTM0->COMBINE)
#define FTM0_DEADTIME                  (FTM0->DEADTIME)
#define FTM0_EXTTRIG                   (FTM0->EXTTRIG)
#define FTM0_POL                       (FTM0->POL)
#define FTM0_FMS                       (FTM0->FMS)
#define FTM0_FILTER                    (FTM0->FILTER)
#define FTM0_FLTCTRL                   (FTM0->FLTCTRL)
#define FTM0_QDCTRL                    (FTM0->QDCTRL)
#define FTM0_CONF                      (FTM0->CONF)
#define FTM0_FLTPOL                    (FTM0->FLTPOL)
#define FTM0_SYNCONF                   (FTM0->SYNCONF)
#define FTM0_INVCTRL                   (FTM0->INVCTRL)
#define FTM0_SWOCTRL                   (FTM0->SWOCTRL)
#define FTM0_PWMLOAD                   (FTM0->PWMLOAD)

/* ================================================================================ */
/* ================           FTM1 (file:FTM1_2CH)                 ================ */
/* ================================================================================ */

/**
 * @brief FlexTimer Module (2 channels)
 */
typedef struct {                                /*!<       FTM1 Structure                                               */
   __IO uint32_t  SC;                           /*!< 0000: Status and Control                                           */
   __IO uint32_t  CNT;                          /*!< 0004: Counter                                                      */
   __IO uint32_t  MOD;                          /*!< 0008: Modulo                                                       */
   struct { /* (cluster) */                     /*!< 000C: (size=0x0010, 16)                                            */
      __IO uint32_t  CnSC;                      /*!< 000C: Channel %s Status and Control                                */
      __IO uint32_t  CnV;                       /*!< 0010: Channel %s Value                                             */
   } CONTROLS[2];
   __I  uint32_t  RESERVED0[12];                /*!< 001C:                                                              */
   __IO uint32_t  CNTIN;                        /*!< 004C: Counter Initial Value                                        */
   __IO uint32_t  STATUS;                       /*!< 0050: Capture and Compare Status                                   */
   __IO uint32_t  MODE;                         /*!< 0054: Features Mode Selection                                      */
   __IO uint32_t  SYNC;                         /*!< 0058: Synchronization                                              */
   __IO uint32_t  OUTINIT;                      /*!< 005C: Initial State for Channels Output                            */
   __IO uint32_t  OUTMASK;                      /*!< 0060: Output Mask                                                  */
   __IO uint32_t  COMBINE;                      /*!< 0064: Function for Linked Channels                                 */
   __IO uint32_t  DEADTIME;                     /*!< 0068: Deadtime Insertion Control                                   */
   __IO uint32_t  EXTTRIG;                      /*!< 006C: FTM External Trigger                                         */
   __IO uint32_t  POL;                          /*!< 0070: Channels Polarity                                            */
   __IO uint32_t  FMS;                          /*!< 0074: Fault Mode Status                                            */
   __IO uint32_t  FILTER;                       /*!< 0078: Input Capture Filter Control                                 */
   __IO uint32_t  FLTCTRL;                      /*!< 007C: Fault Control                                                */
   __IO uint32_t  QDCTRL;                       /*!< 0080: Quadrature Decoder Control and Status                        */
   __IO uint32_t  CONF;                         /*!< 0084: Configuration                                                */
   __IO uint32_t  FLTPOL;                       /*!< 0088: FTM Fault Input Polarity                                     */
   __IO uint32_t  SYNCONF;                      /*!< 008C: Synchronization Configuration                                */
   __IO uint32_t  INVCTRL;                      /*!< 0090: FTM Inverting Control                                        */
   __IO uint32_t  SWOCTRL;                      /*!< 0094: FTM Software Output Control                                  */
   __IO uint32_t  PWMLOAD;                      /*!< 0098: FTM PWM Load                                                 */
} FTM1_Type;


/* -------------------------------------------------------------------------------- */
/* -----------     'FTM1' Position & Mask macros                        ----------- */
/* -------------------------------------------------------------------------------- */


/* ------- FTM1_SC                                  ------ */

/* ------- FTM1_CNT                                 ------ */

/* ------- FTM1_MOD                                 ------ */

/* ------- FTM1_CnSC                                ------ */

/* ------- FTM1_CnV                                 ------ */

/* ------- FTM1_CNTIN                               ------ */

/* ------- FTM1_STATUS                              ------ */

/* ------- FTM1_MODE                                ------ */

