podonoghue/usbdm-firmware/USBDM_Kinetis/Project_Headers/MK20DX128M5.h
/* ------- FTM1_SYNC                                ------ */

/* ------- FTM1_OUTINIT                             ------ */

/* ------- FTM1_OUTMASK                             ------ */

/* ------- FTM1_COMBINE                             ------ */

/* ------- FTM1_DEADTIME                            ------ */

/* ------- FTM1_EXTTRIG                             ------ */

/* ------- FTM1_POL                                 ------ */

/* ------- FTM1_FMS                                 ------ */

/* ------- FTM1_FILTER                              ------ */

/* ------- FTM1_FLTCTRL                             ------ */

/* ------- FTM1_QDCTRL                              ------ */

/* ------- FTM1_CONF                                ------ */

/* ------- FTM1_FLTPOL                              ------ */

/* ------- FTM1_SYNCONF                             ------ */

/* ------- FTM1_INVCTRL                             ------ */

/* ------- FTM1_SWOCTRL                             ------ */

/* ------- FTM1_PWMLOAD                             ------ */

/* -------------------------------------------------------------------------------- */
/* -----------     'FTM1' Register Access macros                        ----------- */
/* -------------------------------------------------------------------------------- */

#define FTM1_SC                        (FTM1->SC)
#define FTM1_CNT                       (FTM1->CNT)
#define FTM1_MOD                       (FTM1->MOD)
#define FTM1_C0SC                      (FTM1->CONTROLS[0].CnSC)
#define FTM1_C0V                       (FTM1->CONTROLS[0].CnV)
#define FTM1_C1SC                      (FTM1->CONTROLS[1].CnSC)
#define FTM1_C1V                       (FTM1->CONTROLS[1].CnV)
#define FTM1_CNTIN                     (FTM1->CNTIN)
#define FTM1_STATUS                    (FTM1->STATUS)
#define FTM1_MODE                      (FTM1->MODE)
#define FTM1_SYNC                      (FTM1->SYNC)
#define FTM1_OUTINIT                   (FTM1->OUTINIT)
#define FTM1_OUTMASK                   (FTM1->OUTMASK)
#define FTM1_COMBINE                   (FTM1->COMBINE)
#define FTM1_DEADTIME                  (FTM1->DEADTIME)
#define FTM1_EXTTRIG                   (FTM1->EXTTRIG)
#define FTM1_POL                       (FTM1->POL)
#define FTM1_FMS                       (FTM1->FMS)
#define FTM1_FILTER                    (FTM1->FILTER)
#define FTM1_FLTCTRL                   (FTM1->FLTCTRL)
#define FTM1_QDCTRL                    (FTM1->QDCTRL)
#define FTM1_CONF                      (FTM1->CONF)
#define FTM1_FLTPOL                    (FTM1->FLTPOL)
#define FTM1_SYNCONF                   (FTM1->SYNCONF)
#define FTM1_INVCTRL                   (FTM1->INVCTRL)
#define FTM1_SWOCTRL                   (FTM1->SWOCTRL)
#define FTM1_PWMLOAD                   (FTM1->PWMLOAD)

/* ================================================================================ */
/* ================           GPIOA (file:GPIOA_0)                 ================ */
/* ================================================================================ */

/**
 * @brief General Purpose Input/Output
 */
typedef struct {                                /*!<       GPIOA Structure                                              */
   __IO uint32_t  PDOR;                         /*!< 0000: Port Data Output Register                                    */
   __O  uint32_t  PSOR;                         /*!< 0004: Port Set Output Register                                     */
   __O  uint32_t  PCOR;                         /*!< 0008: Port Clear Output Register                                   */
   __O  uint32_t  PTOR;                         /*!< 000C: Port Toggle Output Register                                  */
   __I  uint32_t  PDIR;                         /*!< 0010: Port Data Input Register                                     */
   __IO uint32_t  PDDR;                         /*!< 0014: Port Data Direction Register                                 */
} GPIOA_Type;


/* -------------------------------------------------------------------------------- */
/* -----------     'GPIOA' Position & Mask macros                       ----------- */
/* -------------------------------------------------------------------------------- */


/* ------- GPIOA_PDOR                               ------ */
#define GPIO_PDOR_PDO_MASK                       (0xFFFFFFFFUL << GPIO_PDOR_PDO_SHIFT)               /*!< GPIOA_PDOR: PDO Mask                    */
#define GPIO_PDOR_PDO_SHIFT                      0                                                   /*!< GPIOA_PDOR: PDO Position                */
#define GPIO_PDOR_PDO(x)                         (((x)<<GPIO_PDOR_PDO_SHIFT)&GPIO_PDOR_PDO_MASK)     /*!< GPIOA_PDOR                              */

/* ------- GPIOA_PSOR                               ------ */
#define GPIO_PSOR_PTSO_MASK                      (0xFFFFFFFFUL << GPIO_PSOR_PTSO_SHIFT)              /*!< GPIOA_PSOR: PTSO Mask                   */
#define GPIO_PSOR_PTSO_SHIFT                     0                                                   /*!< GPIOA_PSOR: PTSO Position               */
#define GPIO_PSOR_PTSO(x)                        (((x)<<GPIO_PSOR_PTSO_SHIFT)&GPIO_PSOR_PTSO_MASK)   /*!< GPIOA_PSOR                              */

/* ------- GPIOA_PCOR                               ------ */
#define GPIO_PCOR_PTCO_MASK                      (0xFFFFFFFFUL << GPIO_PCOR_PTCO_SHIFT)              /*!< GPIOA_PCOR: PTCO Mask                   */
#define GPIO_PCOR_PTCO_SHIFT                     0                                                   /*!< GPIOA_PCOR: PTCO Position               */
#define GPIO_PCOR_PTCO(x)                        (((x)<<GPIO_PCOR_PTCO_SHIFT)&GPIO_PCOR_PTCO_MASK)   /*!< GPIOA_PCOR                              */

/* ------- GPIOA_PTOR                               ------ */
#define GPIO_PTOR_PTTO_MASK                      (0xFFFFFFFFUL << GPIO_PTOR_PTTO_SHIFT)              /*!< GPIOA_PTOR: PTTO Mask                   */
#define GPIO_PTOR_PTTO_SHIFT                     0                                                   /*!< GPIOA_PTOR: PTTO Position               */
#define GPIO_PTOR_PTTO(x)                        (((x)<<GPIO_PTOR_PTTO_SHIFT)&GPIO_PTOR_PTTO_MASK)   /*!< GPIOA_PTOR                              */

/* ------- GPIOA_PDIR                               ------ */
#define GPIO_PDIR_PDI_MASK                       (0xFFFFFFFFUL << GPIO_PDIR_PDI_SHIFT)               /*!< GPIOA_PDIR: PDI Mask                    */
#define GPIO_PDIR_PDI_SHIFT                      0                                                   /*!< GPIOA_PDIR: PDI Position                */
#define GPIO_PDIR_PDI(x)                         (((x)<<GPIO_PDIR_PDI_SHIFT)&GPIO_PDIR_PDI_MASK)     /*!< GPIOA_PDIR                              */

/* ------- GPIOA_PDDR                               ------ */
#define GPIO_PDDR_PDD_MASK                       (0xFFFFFFFFUL << GPIO_PDDR_PDD_SHIFT)               /*!< GPIOA_PDDR: PDD Mask                    */
#define GPIO_PDDR_PDD_SHIFT                      0                                                   /*!< GPIOA_PDDR: PDD Position                */
#define GPIO_PDDR_PDD(x)                         (((x)<<GPIO_PDDR_PDD_SHIFT)&GPIO_PDDR_PDD_MASK)     /*!< GPIOA_PDDR                              */

/* -------------------------------------------------------------------------------- */
/* -----------     'GPIOA' Register Access macros                       ----------- */
/* -------------------------------------------------------------------------------- */

#define GPIOA_PDOR                     (GPIOA->PDOR)
#define GPIOA_PSOR                     (GPIOA->PSOR)
#define GPIOA_PCOR                     (GPIOA->PCOR)
#define GPIOA_PTOR                     (GPIOA->PTOR)
#define GPIOA_PDIR                     (GPIOA->PDIR)
#define GPIOA_PDDR                     (GPIOA->PDDR)

/* ================================================================================ */
/* ================           GPIOB (derived from GPIOA)           ================ */
/* ================================================================================ */

/**
 * @brief General Purpose Input/Output
 */
typedef GPIOA_Type GPIOB_Type;  /*!< GPIOB Structure                                             */


/* -------------------------------------------------------------------------------- */
/* -----------     'GPIOB' Register Access macros                       ----------- */
/* -------------------------------------------------------------------------------- */

