podonoghue/usbdm-firmware/USBDM_Kinetis/Project_Headers/MK20DX128M5.h
/* ------- TPIU_CID3                                ------ */
#define TPIU_CID3_Preamble_MASK                  (0xFFUL << TPIU_CID3_Preamble_SHIFT)                /*!< TPIU_CID3: Preamble Mask                */
#define TPIU_CID3_Preamble_SHIFT                 0                                                   /*!< TPIU_CID3: Preamble Position            */
#define TPIU_CID3_Preamble(x)                    (((x)<<TPIU_CID3_Preamble_SHIFT)&TPIU_CID3_Preamble_MASK) /*!< TPIU_CID3                               */

/* -------------------------------------------------------------------------------- */
/* -----------     'TPIU' Register Access macros                        ----------- */
/* -------------------------------------------------------------------------------- */

#define TPIU_SSPSR                     (TPIU->SSPSR)
#define TPIU_CSPSR                     (TPIU->CSPSR)
#define TPIU_ACPR                      (TPIU->ACPR)
#define TPIU_SPPR                      (TPIU->SPPR)
#define TPIU_FFSR                      (TPIU->FFSR)
#define TPIU_FFCR                      (TPIU->FFCR)
#define TPIU_FSCR                      (TPIU->FSCR)
#define TPIU_TRIGGER                   (TPIU->TRIGGER)
#define TPIU_FIFODATA0                 (TPIU->FIFODATA0)
#define TPIU_ITATBCTR2                 (TPIU->ITATBCTR2)
#define TPIU_ITATBCTR0                 (TPIU->ITATBCTR0)
#define TPIU_FIFODATA1                 (TPIU->FIFODATA1)
#define TPIU_ITCTRL                    (TPIU->ITCTRL)
#define TPIU_CLAIMSET                  (TPIU->CLAIMSET)
#define TPIU_CLAIMCLR                  (TPIU->CLAIMCLR)
#define TPIU_DEVID                     (TPIU->DEVID)
#define TPIU_PID4                      (TPIU->PID4)
#define TPIU_PID5                      (TPIU->PID5)
#define TPIU_PID6                      (TPIU->PID6)
#define TPIU_PID7                      (TPIU->PID7)
#define TPIU_PID0                      (TPIU->PID0)
#define TPIU_PID1                      (TPIU->PID1)
#define TPIU_PID2                      (TPIU->PID2)
#define TPIU_PID3                      (TPIU->PID3)
#define TPIU_CID0                      (TPIU->CID0)
#define TPIU_CID1                      (TPIU->CID1)
#define TPIU_CID2                      (TPIU->CID2)
#define TPIU_CID3                      (TPIU->CID3)

/* ================================================================================ */
/* ================           TSI0 (file:TSI0_MK)                  ================ */
/* ================================================================================ */

/**
 * @brief Touch Sensing Input
 */
typedef struct {                                /*!<       TSI0 Structure                                               */
   __IO uint32_t  GENCS;                        /*!< 0000: General Control and Status Register                          */
   __IO uint32_t  SCANC;                        /*!< 0004: SCAN Control Register                                        */
   __IO uint32_t  PEN;                          /*!< 0008: Pin Enable Register                                          */
   __I  uint32_t  WUCNTR;                       /*!< 000C: Wake-Up Channel Counter Register                             */
   __I  uint32_t  RESERVED0[60];                /*!< 0010:                                                              */
   __I  uint32_t  CNTR1;                        /*!< 0100: Counter Register                                             */
   __I  uint32_t  CNTR3;                        /*!< 0104: Counter Register                                             */
   __I  uint32_t  CNTR5;                        /*!< 0108: Counter Register                                             */
   __I  uint32_t  CNTR7;                        /*!< 010C: Counter Register                                             */
   __I  uint32_t  CNTR9;                        /*!< 0110: Counter Register                                             */
   __I  uint32_t  CNTR11;                       /*!< 0114: Counter Register                                             */
   __I  uint32_t  CNTR13;                       /*!< 0118: Counter Register                                             */
   __I  uint32_t  CNTR15;                       /*!< 011C: Counter Register                                             */
   __IO uint32_t  THRESHOLD;                    /*!< 0120: Low Power Channel Threshold Register                         */
} TSI0_Type;


/* -------------------------------------------------------------------------------- */
/* -----------     'TSI0' Position & Mask macros                        ----------- */
/* -------------------------------------------------------------------------------- */


/* ------- TSI0_GENCS                               ------ */
#define TSI_GENCS_STPE_MASK                      (0x01UL << TSI_GENCS_STPE_SHIFT)                    /*!< TSI0_GENCS: STPE Mask                   */
#define TSI_GENCS_STPE_SHIFT                     0                                                   /*!< TSI0_GENCS: STPE Position               */
#define TSI_GENCS_STM_MASK                       (0x01UL << TSI_GENCS_STM_SHIFT)                     /*!< TSI0_GENCS: STM Mask                    */
#define TSI_GENCS_STM_SHIFT                      1                                                   /*!< TSI0_GENCS: STM Position                */
#define TSI_GENCS_ESOR_MASK                      (0x01UL << TSI_GENCS_ESOR_SHIFT)                    /*!< TSI0_GENCS: ESOR Mask                   */
#define TSI_GENCS_ESOR_SHIFT                     4                                                   /*!< TSI0_GENCS: ESOR Position               */
#define TSI_GENCS_ERIE_MASK                      (0x01UL << TSI_GENCS_ERIE_SHIFT)                    /*!< TSI0_GENCS: ERIE Mask                   */
#define TSI_GENCS_ERIE_SHIFT                     5                                                   /*!< TSI0_GENCS: ERIE Position               */
#define TSI_GENCS_TSIIE_MASK                     (0x01UL << TSI_GENCS_TSIIE_SHIFT)                   /*!< TSI0_GENCS: TSIIE Mask                  */
#define TSI_GENCS_TSIIE_SHIFT                    6                                                   /*!< TSI0_GENCS: TSIIE Position              */
#define TSI_GENCS_TSIEN_MASK                     (0x01UL << TSI_GENCS_TSIEN_SHIFT)                   /*!< TSI0_GENCS: TSIEN Mask                  */
#define TSI_GENCS_TSIEN_SHIFT                    7                                                   /*!< TSI0_GENCS: TSIEN Position              */
#define TSI_GENCS_SWTS_MASK                      (0x01UL << TSI_GENCS_SWTS_SHIFT)                    /*!< TSI0_GENCS: SWTS Mask                   */
#define TSI_GENCS_SWTS_SHIFT                     8                                                   /*!< TSI0_GENCS: SWTS Position               */
#define TSI_GENCS_SCNIP_MASK                     (0x01UL << TSI_GENCS_SCNIP_SHIFT)                   /*!< TSI0_GENCS: SCNIP Mask                  */
#define TSI_GENCS_SCNIP_SHIFT                    9                                                   /*!< TSI0_GENCS: SCNIP Position              */
#define TSI_GENCS_OVRF_MASK                      (0x01UL << TSI_GENCS_OVRF_SHIFT)                    /*!< TSI0_GENCS: OVRF Mask                   */
#define TSI_GENCS_OVRF_SHIFT                     12                                                  /*!< TSI0_GENCS: OVRF Position               */
#define TSI_GENCS_EXTERF_MASK                    (0x01UL << TSI_GENCS_EXTERF_SHIFT)                  /*!< TSI0_GENCS: EXTERF Mask                 */
#define TSI_GENCS_EXTERF_SHIFT                   13                                                  /*!< TSI0_GENCS: EXTERF Position             */
#define TSI_GENCS_OUTRGF_MASK                    (0x01UL << TSI_GENCS_OUTRGF_SHIFT)                  /*!< TSI0_GENCS: OUTRGF Mask                 */
#define TSI_GENCS_OUTRGF_SHIFT                   14                                                  /*!< TSI0_GENCS: OUTRGF Position             */
#define TSI_GENCS_EOSF_MASK                      (0x01UL << TSI_GENCS_EOSF_SHIFT)                    /*!< TSI0_GENCS: EOSF Mask                   */
#define TSI_GENCS_EOSF_SHIFT                     15                                                  /*!< TSI0_GENCS: EOSF Position               */
#define TSI_GENCS_PS_MASK                        (0x07UL << TSI_GENCS_PS_SHIFT)                      /*!< TSI0_GENCS: PS Mask                     */
#define TSI_GENCS_PS_SHIFT                       16                                                  /*!< TSI0_GENCS: PS Position                 */
#define TSI_GENCS_PS(x)                          (((x)<<TSI_GENCS_PS_SHIFT)&TSI_GENCS_PS_MASK)       /*!< TSI0_GENCS                              */
#define TSI_GENCS_NSCN_MASK                      (0x1FUL << TSI_GENCS_NSCN_SHIFT)                    /*!< TSI0_GENCS: NSCN Mask                   */
#define TSI_GENCS_NSCN_SHIFT                     19                                                  /*!< TSI0_GENCS: NSCN Position               */
#define TSI_GENCS_NSCN(x)                        (((x)<<TSI_GENCS_NSCN_SHIFT)&TSI_GENCS_NSCN_MASK)   /*!< TSI0_GENCS                              */
#define TSI_GENCS_LPSCNITV_MASK                  (0x0FUL << TSI_GENCS_LPSCNITV_SHIFT)                /*!< TSI0_GENCS: LPSCNITV Mask               */
#define TSI_GENCS_LPSCNITV_SHIFT                 24                                                  /*!< TSI0_GENCS: LPSCNITV Position           */
#define TSI_GENCS_LPSCNITV(x)                    (((x)<<TSI_GENCS_LPSCNITV_SHIFT)&TSI_GENCS_LPSCNITV_MASK) /*!< TSI0_GENCS                              */
#define TSI_GENCS_LPCLKS_MASK                    (0x01UL << TSI_GENCS_LPCLKS_SHIFT)                  /*!< TSI0_GENCS: LPCLKS Mask                 */
#define TSI_GENCS_LPCLKS_SHIFT                   28                                                  /*!< TSI0_GENCS: LPCLKS Position             */

