podonoghue/usbdm-firmware/USBDM_Kinetis/Project_Headers/MK20DX128M5.h
/* ------- UART0_WF7816                             ------ */
#define UART_WF7816_GTFD_MASK                    (0xFFUL << UART_WF7816_GTFD_SHIFT)                  /*!< UART0_WF7816: GTFD Mask                 */
#define UART_WF7816_GTFD_SHIFT                   0                                                   /*!< UART0_WF7816: GTFD Position             */
#define UART_WF7816_GTFD(x)                      (((x)<<UART_WF7816_GTFD_SHIFT)&UART_WF7816_GTFD_MASK) /*!< UART0_WF7816                            */

/* ------- UART0_ET7816                             ------ */
#define UART_ET7816_RXTHRESHOLD_MASK             (0x0FUL << UART_ET7816_RXTHRESHOLD_SHIFT)           /*!< UART0_ET7816: RXTHRESHOLD Mask          */
#define UART_ET7816_RXTHRESHOLD_SHIFT            0                                                   /*!< UART0_ET7816: RXTHRESHOLD Position      */
#define UART_ET7816_RXTHRESHOLD(x)               (((x)<<UART_ET7816_RXTHRESHOLD_SHIFT)&UART_ET7816_RXTHRESHOLD_MASK) /*!< UART0_ET7816                            */
#define UART_ET7816_TXTHRESHOLD_MASK             (0x0FUL << UART_ET7816_TXTHRESHOLD_SHIFT)           /*!< UART0_ET7816: TXTHRESHOLD Mask          */
#define UART_ET7816_TXTHRESHOLD_SHIFT            4                                                   /*!< UART0_ET7816: TXTHRESHOLD Position      */
#define UART_ET7816_TXTHRESHOLD(x)               (((x)<<UART_ET7816_TXTHRESHOLD_SHIFT)&UART_ET7816_TXTHRESHOLD_MASK) /*!< UART0_ET7816                            */

/* ------- UART0_TL7816                             ------ */
#define UART_TL7816_TLEN_MASK                    (0xFFUL << UART_TL7816_TLEN_SHIFT)                  /*!< UART0_TL7816: TLEN Mask                 */
#define UART_TL7816_TLEN_SHIFT                   0                                                   /*!< UART0_TL7816: TLEN Position             */
#define UART_TL7816_TLEN(x)                      (((x)<<UART_TL7816_TLEN_SHIFT)&UART_TL7816_TLEN_MASK) /*!< UART0_TL7816                            */

/* ------- UART0_C6                                 ------ */
#define UART_C6_CP_MASK                          (0x01UL << UART_C6_CP_SHIFT)                        /*!< UART0_C6: CP Mask                       */
#define UART_C6_CP_SHIFT                         4                                                   /*!< UART0_C6: CP Position                   */
#define UART_C6_CE_MASK                          (0x01UL << UART_C6_CE_SHIFT)                        /*!< UART0_C6: CE Mask                       */
#define UART_C6_CE_SHIFT                         5                                                   /*!< UART0_C6: CE Position                   */
#define UART_C6_TX709_MASK                       (0x01UL << UART_C6_TX709_SHIFT)                     /*!< UART0_C6: TX709 Mask                    */
#define UART_C6_TX709_SHIFT                      6                                                   /*!< UART0_C6: TX709 Position                */
#define UART_C6_EN709_MASK                       (0x01UL << UART_C6_EN709_SHIFT)                     /*!< UART0_C6: EN709 Mask                    */
#define UART_C6_EN709_SHIFT                      7                                                   /*!< UART0_C6: EN709 Position                */

/* ------- UART0_PCTH                               ------ */
#define UART_PCTH_PCTH_MASK                      (0xFFUL << UART_PCTH_PCTH_SHIFT)                    /*!< UART0_PCTH: PCTH Mask                   */
#define UART_PCTH_PCTH_SHIFT                     0                                                   /*!< UART0_PCTH: PCTH Position               */
#define UART_PCTH_PCTH(x)                        (((x)<<UART_PCTH_PCTH_SHIFT)&UART_PCTH_PCTH_MASK)   /*!< UART0_PCTH                              */

/* ------- UART0_PCTL                               ------ */
#define UART_PCTL_PCTL_MASK                      (0xFFUL << UART_PCTL_PCTL_SHIFT)                    /*!< UART0_PCTL: PCTL Mask                   */
#define UART_PCTL_PCTL_SHIFT                     0                                                   /*!< UART0_PCTL: PCTL Position               */
#define UART_PCTL_PCTL(x)                        (((x)<<UART_PCTL_PCTL_SHIFT)&UART_PCTL_PCTL_MASK)   /*!< UART0_PCTL                              */

/* ------- UART0_B1T                                ------ */
#define UART_B1T_B1T_MASK                        (0xFFUL << UART_B1T_B1T_SHIFT)                      /*!< UART0_B1T: B1T Mask                     */
#define UART_B1T_B1T_SHIFT                       0                                                   /*!< UART0_B1T: B1T Position                 */
#define UART_B1T_B1T(x)                          (((x)<<UART_B1T_B1T_SHIFT)&UART_B1T_B1T_MASK)       /*!< UART0_B1T                               */

/* ------- UART0_SDTH                               ------ */
#define UART_SDTH_SDTH_MASK                      (0xFFUL << UART_SDTH_SDTH_SHIFT)                    /*!< UART0_SDTH: SDTH Mask                   */
#define UART_SDTH_SDTH_SHIFT                     0                                                   /*!< UART0_SDTH: SDTH Position               */
#define UART_SDTH_SDTH(x)                        (((x)<<UART_SDTH_SDTH_SHIFT)&UART_SDTH_SDTH_MASK)   /*!< UART0_SDTH                              */

/* ------- UART0_SDTL                               ------ */
#define UART_SDTL_SDTL_MASK                      (0xFFUL << UART_SDTL_SDTL_SHIFT)                    /*!< UART0_SDTL: SDTL Mask                   */
#define UART_SDTL_SDTL_SHIFT                     0                                                   /*!< UART0_SDTL: SDTL Position               */
#define UART_SDTL_SDTL(x)                        (((x)<<UART_SDTL_SDTL_SHIFT)&UART_SDTL_SDTL_MASK)   /*!< UART0_SDTL                              */

/* ------- UART0_PRE                                ------ */
#define UART_PRE_PREAMBLE_MASK                   (0xFFUL << UART_PRE_PREAMBLE_SHIFT)                 /*!< UART0_PRE: PREAMBLE Mask                */
#define UART_PRE_PREAMBLE_SHIFT                  0                                                   /*!< UART0_PRE: PREAMBLE Position            */
#define UART_PRE_PREAMBLE(x)                     (((x)<<UART_PRE_PREAMBLE_SHIFT)&UART_PRE_PREAMBLE_MASK) /*!< UART0_PRE                               */

/* ------- UART0_TPL                                ------ */
#define UART_TPL_TPL_MASK                        (0xFFUL << UART_TPL_TPL_SHIFT)                      /*!< UART0_TPL: TPL Mask                     */
#define UART_TPL_TPL_SHIFT                       0                                                   /*!< UART0_TPL: TPL Position                 */
#define UART_TPL_TPL(x)                          (((x)<<UART_TPL_TPL_SHIFT)&UART_TPL_TPL_MASK)       /*!< UART0_TPL                               */

/* ------- UART0_IE                                 ------ */
#define UART_IE_TXFIE_MASK                       (0x01UL << UART_IE_TXFIE_SHIFT)                     /*!< UART0_IE: TXFIE Mask                    */
#define UART_IE_TXFIE_SHIFT                      0                                                   /*!< UART0_IE: TXFIE Position                */
#define UART_IE_PSIE_MASK                        (0x01UL << UART_IE_PSIE_SHIFT)                      /*!< UART0_IE: PSIE Mask                     */
#define UART_IE_PSIE_SHIFT                       1                                                   /*!< UART0_IE: PSIE Position                 */
#define UART_IE_PCTEIE_MASK                      (0x01UL << UART_IE_PCTEIE_SHIFT)                    /*!< UART0_IE: PCTEIE Mask                   */
#define UART_IE_PCTEIE_SHIFT                     2                                                   /*!< UART0_IE: PCTEIE Position               */
#define UART_IE_PTXIE_MASK                       (0x01UL << UART_IE_PTXIE_SHIFT)                     /*!< UART0_IE: PTXIE Mask                    */
#define UART_IE_PTXIE_SHIFT                      3                                                   /*!< UART0_IE: PTXIE Position                */
#define UART_IE_PRXIE_MASK                       (0x01UL << UART_IE_PRXIE_SHIFT)                     /*!< UART0_IE: PRXIE Mask                    */
#define UART_IE_PRXIE_SHIFT                      4                                                   /*!< UART0_IE: PRXIE Position                */
#define UART_IE_ISDIE_MASK                       (0x01UL << UART_IE_ISDIE_SHIFT)                     /*!< UART0_IE: ISDIE Mask                    */
#define UART_IE_ISDIE_SHIFT                      5                                                   /*!< UART0_IE: ISDIE Position                */
#define UART_IE_WBEIE_MASK                       (0x01UL << UART_IE_WBEIE_SHIFT)                     /*!< UART0_IE: WBEIE Mask                    */
#define UART_IE_WBEIE_SHIFT                      6                                                   /*!< UART0_IE: WBEIE Position                */

/* ------- UART0_WB                                 ------ */
#define UART_WB_WBASE_MASK                       (0xFFUL << UART_WB_WBASE_SHIFT)                     /*!< UART0_WB: WBASE Mask                    */
#define UART_WB_WBASE_SHIFT                      0                                                   /*!< UART0_WB: WBASE Position                */
#define UART_WB_WBASE(x)                         (((x)<<UART_WB_WBASE_SHIFT)&UART_WB_WBASE_MASK)     /*!< UART0_WB                                */

