podonoghue/usbdm-firmware/USBDM_Kinetis/Project_Headers/MK20DX128M5.h
/* ------- UART0_S3                                 ------ */
#define UART_S3_TXFF_MASK                        (0x01UL << UART_S3_TXFF_SHIFT)                      /*!< UART0_S3: TXFF Mask                     */
#define UART_S3_TXFF_SHIFT                       0                                                   /*!< UART0_S3: TXFF Position                 */
#define UART_S3_PSF_MASK                         (0x01UL << UART_S3_PSF_SHIFT)                       /*!< UART0_S3: PSF Mask                      */
#define UART_S3_PSF_SHIFT                        1                                                   /*!< UART0_S3: PSF Position                  */
#define UART_S3_PCTEF_MASK                       (0x01UL << UART_S3_PCTEF_SHIFT)                     /*!< UART0_S3: PCTEF Mask                    */
#define UART_S3_PCTEF_SHIFT                      2                                                   /*!< UART0_S3: PCTEF Position                */
#define UART_S3_PTXF_MASK                        (0x01UL << UART_S3_PTXF_SHIFT)                      /*!< UART0_S3: PTXF Mask                     */
#define UART_S3_PTXF_SHIFT                       3                                                   /*!< UART0_S3: PTXF Position                 */
#define UART_S3_PRXF_MASK                        (0x01UL << UART_S3_PRXF_SHIFT)                      /*!< UART0_S3: PRXF Mask                     */
#define UART_S3_PRXF_SHIFT                       4                                                   /*!< UART0_S3: PRXF Position                 */
#define UART_S3_ISD_MASK                         (0x01UL << UART_S3_ISD_SHIFT)                       /*!< UART0_S3: ISD Mask                      */
#define UART_S3_ISD_SHIFT                        5                                                   /*!< UART0_S3: ISD Position                  */
#define UART_S3_WBEF_MASK                        (0x01UL << UART_S3_WBEF_SHIFT)                      /*!< UART0_S3: WBEF Mask                     */
#define UART_S3_WBEF_SHIFT                       6                                                   /*!< UART0_S3: WBEF Position                 */
#define UART_S3_PEF_MASK                         (0x01UL << UART_S3_PEF_SHIFT)                       /*!< UART0_S3: PEF Mask                      */
#define UART_S3_PEF_SHIFT                        7                                                   /*!< UART0_S3: PEF Position                  */

/* ------- UART0_S4                                 ------ */
#define UART_S4_FE_MASK                          (0x01UL << UART_S4_FE_SHIFT)                        /*!< UART0_S4: FE Mask                       */
#define UART_S4_FE_SHIFT                         0                                                   /*!< UART0_S4: FE Position                   */
#define UART_S4_ILCV_MASK                        (0x01UL << UART_S4_ILCV_SHIFT)                      /*!< UART0_S4: ILCV Mask                     */
#define UART_S4_ILCV_SHIFT                       1                                                   /*!< UART0_S4: ILCV Position                 */
#define UART_S4_CDET_MASK                        (0x03UL << UART_S4_CDET_SHIFT)                      /*!< UART0_S4: CDET Mask                     */
#define UART_S4_CDET_SHIFT                       2                                                   /*!< UART0_S4: CDET Position                 */
#define UART_S4_CDET(x)                          (((x)<<UART_S4_CDET_SHIFT)&UART_S4_CDET_MASK)       /*!< UART0_S4                                */
#define UART_S4_INITF_MASK                       (0x01UL << UART_S4_INITF_SHIFT)                     /*!< UART0_S4: INITF Mask                    */
#define UART_S4_INITF_SHIFT                      4                                                   /*!< UART0_S4: INITF Position                */

/* ------- UART0_RPL                                ------ */
#define UART_RPL_RPL_MASK                        (0xFFUL << UART_RPL_RPL_SHIFT)                      /*!< UART0_RPL: RPL Mask                     */
#define UART_RPL_RPL_SHIFT                       0                                                   /*!< UART0_RPL: RPL Position                 */
#define UART_RPL_RPL(x)                          (((x)<<UART_RPL_RPL_SHIFT)&UART_RPL_RPL_MASK)       /*!< UART0_RPL                               */

/* ------- UART0_RPREL                              ------ */
#define UART_RPREL_RPREL_MASK                    (0xFFUL << UART_RPREL_RPREL_SHIFT)                  /*!< UART0_RPREL: RPREL Mask                 */
#define UART_RPREL_RPREL_SHIFT                   0                                                   /*!< UART0_RPREL: RPREL Position             */
#define UART_RPREL_RPREL(x)                      (((x)<<UART_RPREL_RPREL_SHIFT)&UART_RPREL_RPREL_MASK) /*!< UART0_RPREL                             */

/* ------- UART0_CPW                                ------ */
#define UART_CPW_CPW_MASK                        (0xFFUL << UART_CPW_CPW_SHIFT)                      /*!< UART0_CPW: CPW Mask                     */
#define UART_CPW_CPW_SHIFT                       0                                                   /*!< UART0_CPW: CPW Position                 */
#define UART_CPW_CPW(x)                          (((x)<<UART_CPW_CPW_SHIFT)&UART_CPW_CPW_MASK)       /*!< UART0_CPW                               */

/* ------- UART0_RIDT                               ------ */
#define UART_RIDT_RIDT_MASK                      (0xFFUL << UART_RIDT_RIDT_SHIFT)                    /*!< UART0_RIDT: RIDT Mask                   */
#define UART_RIDT_RIDT_SHIFT                     0                                                   /*!< UART0_RIDT: RIDT Position               */
#define UART_RIDT_RIDT(x)                        (((x)<<UART_RIDT_RIDT_SHIFT)&UART_RIDT_RIDT_MASK)   /*!< UART0_RIDT                              */

/* ------- UART0_TIDT                               ------ */
#define UART_TIDT_TIDT_MASK                      (0xFFUL << UART_TIDT_TIDT_SHIFT)                    /*!< UART0_TIDT: TIDT Mask                   */
#define UART_TIDT_TIDT_SHIFT                     0                                                   /*!< UART0_TIDT: TIDT Position               */
#define UART_TIDT_TIDT(x)                        (((x)<<UART_TIDT_TIDT_SHIFT)&UART_TIDT_TIDT_MASK)   /*!< UART0_TIDT                              */

/* -------------------------------------------------------------------------------- */
/* -----------     'UART0' Register Access macros                       ----------- */
/* -------------------------------------------------------------------------------- */

#define UART0_BDH                      (UART0->BDH)
#define UART0_BDL                      (UART0->BDL)
#define UART0_C1                       (UART0->C1)
#define UART0_C2                       (UART0->C2)
#define UART0_S1                       (UART0->S1)
#define UART0_S2                       (UART0->S2)
#define UART0_C3                       (UART0->C3)
#define UART0_D                        (UART0->D)
#define UART0_MA1                      (UART0->MA1)
#define UART0_MA2                      (UART0->MA2)
#define UART0_C4                       (UART0->C4)
#define UART0_C5                       (UART0->C5)
#define UART0_ED                       (UART0->ED)
#define UART0_MODEM                    (UART0->MODEM)
#define UART0_IR                       (UART0->IR)
#define UART0_PFIFO                    (UART0->PFIFO)
#define UART0_CFIFO                    (UART0->CFIFO)
#define UART0_SFIFO                    (UART0->SFIFO)
#define UART0_TWFIFO                   (UART0->TWFIFO)
#define UART0_TCFIFO                   (UART0->TCFIFO)
#define UART0_RWFIFO                   (UART0->RWFIFO)
#define UART0_RCFIFO                   (UART0->RCFIFO)
#define UART0_C7816                    (UART0->C7816)
#define UART0_IE7816                   (UART0->IE7816)
#define UART0_IS7816                   (UART0->IS7816)
#define UART0_WP7816T0                 (UART0->WP7816T0)
#define UART0_WP7816T1                 (UART0->WP7816T1)
#define UART0_WN7816                   (UART0->WN7816)
#define UART0_WF7816                   (UART0->WF7816)
#define UART0_ET7816                   (UART0->ET7816)
#define UART0_TL7816                   (UART0->TL7816)
#define UART0_C6                       (UART0->C6)
#define UART0_PCTH                     (UART0->PCTH)
#define UART0_PCTL                     (UART0->PCTL)
#define UART0_B1T                      (UART0->B1T)
#define UART0_SDTH                     (UART0->SDTH)
#define UART0_SDTL                     (UART0->SDTL)
#define UART0_PRE                      (UART0->PRE)
#define UART0_TPL                      (UART0->TPL)
#define UART0_IE                       (UART0->IE)
#define UART0_WB                       (UART0->WB)
#define UART0_S3                       (UART0->S3)
#define UART0_S4                       (UART0->S4)
#define UART0_RPL                      (UART0->RPL)
#define UART0_RPREL                    (UART0->RPREL)
#define UART0_CPW                      (UART0->CPW)
#define UART0_RIDT                     (UART0->RIDT)
#define UART0_TIDT                     (UART0->TIDT)

/* ================================================================================ */
/* ================           UART1 (file:UART1_0)                 ================ */
/* ================================================================================ */

/**
 * @brief Universal Asynchronous Receiver/Transmitter
 */
typedef struct {                                /*!<       UART1 Structure                                              */
   __IO uint8_t   BDH;                          /*!< 0000: Baud Rate Register: High                                     */
   __IO uint8_t   BDL;                          /*!< 0001: Baud Rate Register: Low                                      */
   __IO uint8_t   C1;                           /*!< 0002: Control Register 1                                           */
   __IO uint8_t   C2;                           /*!< 0003: Control Register 2                                           */
   __I  uint8_t   S1;                           /*!< 0004: Status Register 1                                            */
   __IO uint8_t   S2;                           /*!< 0005: Status Register 2                                            */
   __IO uint8_t   C3;                           /*!< 0006: Control Register 3                                           */
   __IO uint8_t   D;                            /*!< 0007: Data Register                                                */
   __IO uint8_t   MA1;                          /*!< 0008: Match Address Registers 1                                    */
   __IO uint8_t   MA2;                          /*!< 0009: Match Address Registers 2                                    */
   __IO uint8_t   C4;                           /*!< 000A: Control Register 4                                           */
   __IO uint8_t   C5;                           /*!< 000B: Control Register 5                                           */
   __I  uint8_t   ED;                           /*!< 000C: Extended Data Register                                       */
   __IO uint8_t   MODEM;                        /*!< 000D: Modem Register                                               */
   __IO uint8_t   IR;                           /*!< 000E: Infrared Register                                            */
   __I  uint8_t   RESERVED0;                    /*!< 000F:                                                              */
   __IO uint8_t   PFIFO;                        /*!< 0010: FIFO Parameters                                              */
   __IO uint8_t   CFIFO;                        /*!< 0011: FIFO Control Register                                        */
   __IO uint8_t   SFIFO;                        /*!< 0012: FIFO Status Register                                         */
   __IO uint8_t   TWFIFO;                       /*!< 0013: FIFO Transmit Watermark                                      */
   __I  uint8_t   TCFIFO;                       /*!< 0014: FIFO Transmit Count                                          */
   __IO uint8_t   RWFIFO;                       /*!< 0015: FIFO Receive Watermark                                       */
   __I  uint8_t   RCFIFO;                       /*!< 0016: FIFO Receive Count                                           */
} UART1_Type;


/* -------------------------------------------------------------------------------- */
/* -----------     'UART1' Position & Mask macros                       ----------- */
/* -------------------------------------------------------------------------------- */


/* ------- UART1_BDH                                ------ */

/* ------- UART1_BDL                                ------ */

/* ------- UART1_C1                                 ------ */

/* ------- UART1_C2                                 ------ */

/* ------- UART1_S1                                 ------ */

